lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/EdgeComm/edge_comm.c
/**
 ******************************************************************************
 * @file    edge_comm.c
 * @author  STM32H7 Optimization Expert
 * @brief   EdgeComm WiFi 模组驱动程序 (STM32H7 专用优化版)
 * @note    核心特性：
 * 1. AXI SRAM + D-Cache 一致性维护 (DMA 必备)
 * 2. 2Mbps 高波特率下的软件容错机制 (抗 ORE/FE 错误)
 * 3. 智能流式接收解析 (滑动窗口)
 * 4. 自动故障恢复与重连逻辑
 ******************************************************************************
 */

#include "edge_comm.h"
#include "SPI_AD7606.h"
#include "ad_acq_buffers.h"
#include "edgewind_ai.h"
#include "edgewind_ai_preprocess_params.h"
#include "edgewind_units.h"
#include "edgewind_buzzer.h"
#include "ESP32SPI/esp32_spi_debug.h"
#include "usart.h"
#include "arm_math.h"
#include "cmsis_os.h"
#include "FreeRTOS.h"
#include "task.h"
#include "fatfs.h"
#include "diskio.h"
#include "bsp_driver_sd.h"
#include "../GUI-Guider_Runtime/gui_assets_sync.h"
#include "../SD_Card/sd_fault_log.h"
#include "../SD_Card/sd_time.h"
#include <stdint.h>
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <stdarg.h>
#include <math.h>

#ifndef EW_USE_ESP32_SPI_UI
#define EW_USE_ESP32_SPI_UI 1
#endif

#ifndef ESP32_SPI_STRESS_TEST
#define ESP32_SPI_STRESS_TEST 0
#endif

#ifndef ESP32_SPI_STRESS_FULL_UPLOAD
#define ESP32_SPI_STRESS_FULL_UPLOAD 0
#endif

#ifndef ESP32_SPI_STRESS_SENDLIMIT_MS
#define ESP32_SPI_STRESS_SENDLIMIT_MS 500U
#endif
#ifndef ESP32_SPI_FULL_IDLE_HEARTBEAT_MS
#define ESP32_SPI_FULL_IDLE_HEARTBEAT_MS 5000U
#endif

#ifndef ESP32_SPI_STRESS_DATA_UPDATE_MS
#define ESP32_SPI_STRESS_DATA_UPDATE_MS 1000U
#endif

#ifndef ESP32_SPI_STRESS_SPI_LABEL
#define ESP32_SPI_STRESS_SPI_LABEL "10MHz"
#endif

#ifndef ESP32_SPI_RESULT_OK
#define ESP32_SPI_RESULT_OK 0
#endif

#define ESP_UPLOAD_FAST_CHANNEL_COUNT    4U
#define ESP_UPLOAD_AUX_CHANNEL_COUNT     EDGEWIND_AI_AUX_SIZE
#define ESP_UPLOAD_REPORT_CHANNEL_COUNT  (ESP_UPLOAD_FAST_CHANNEL_COUNT + ESP_UPLOAD_AUX_CHANNEL_COUNT)
#define ESP_UPLOAD_CHANNEL_FLAG_VALID    0x01U

#ifdef EDGEWIND_AI_RAWLITE_SIZE
#define ESP_AI_HAS_RAWLITE 1
#else
#define ESP_AI_HAS_RAWLITE 0
#endif

#ifndef ESP32_SPI_NACK_BUSY
#define ESP32_SPI_NACK_BUSY 5U
#endif
#ifndef ESP32_SPI_NACK_UNSUPPORTED_VERSION
#define ESP32_SPI_NACK_UNSUPPORTED_VERSION 3U
#endif
#ifndef ESP32_SPI_NACK_INVALID_STATE
#define ESP32_SPI_NACK_INVALID_STATE 7U
#endif
#ifndef ESP32_SPI_NACK_INVALID_PAYLOAD
#define ESP32_SPI_NACK_INVALID_PAYLOAD 8U
#endif

#ifndef ESP32_SPI_INVALID_STATE_AUTOSTOP_COUNT
#define ESP32_SPI_INVALID_STATE_AUTOSTOP_COUNT 3U
#endif

#ifndef ESP32_SPI_FULL_CONTINUOUS_DEFAULT
#define ESP32_SPI_FULL_CONTINUOUS_DEFAULT 1
#endif

#ifndef ESP_FORCE_FULL_REPORT_MODE
#define ESP_FORCE_FULL_REPORT_MODE 0
#endif

#ifndef ESP32_SPI_FULL_NOT_ARMED_LOG_MS
#define ESP32_SPI_FULL_NOT_ARMED_LOG_MS 5000U
#endif
#ifndef ESP32_SPI_FULL_RESULT_TIMEOUT_MS
#define ESP32_SPI_FULL_RESULT_TIMEOUT_MS 8000U
#endif
#ifndef ESP32_SPI_FULL_TX_STALE_MS
#define ESP32_SPI_FULL_TX_STALE_MS 8000U
#endif
#ifndef ESP32_SPI_FULL_WAIT_LOG_MS
#define ESP32_SPI_FULL_WAIT_LOG_MS 2000U
#endif
#ifndef ESP32_SPI_FULL_RESULT_POLL_MS
#define ESP32_SPI_FULL_RESULT_POLL_MS 20U
#endif
#ifndef ESP32_SPI_FULL_TIMEOUT_HOLDOFF_MS
#define ESP32_SPI_FULL_TIMEOUT_HOLDOFF_MS 1000U
#endif
#ifndef ESP32_SPI_FULL_HTTP_FAIL_HOLDOFF_MS
#define ESP32_SPI_FULL_HTTP_FAIL_HOLDOFF_MS 500U
#endif
#ifndef ESP32_SPI_FULL_BUSY_HOLDOFF_MS
#define ESP32_SPI_FULL_BUSY_HOLDOFF_MS 3000U
#endif
#ifndef ESP32_SPI_FULL_MAX_HOLDOFF_MS
#define ESP32_SPI_FULL_MAX_HOLDOFF_MS 5000U
#endif
#ifndef ESP_ALGO_MIN_INTERVAL_MS
#define ESP_ALGO_MIN_INTERVAL_MS 250U
#endif
#ifndef EDGEWIND_AI_RUN_INTERVAL_MS
#define EDGEWIND_AI_RUN_INTERVAL_MS 1000U
#endif
#ifndef EDGEWIND_AI_STATS_LOG_MS
#define EDGEWIND_AI_STATS_LOG_MS 5000U
#endif
#ifndef EDGEWIND_AI_GOLDEN_SELFTEST
#define EDGEWIND_AI_GOLDEN_SELFTEST 0
#endif
#ifndef EDGEWIND_AI_GOLDEN_MAX_VECTORS
#define EDGEWIND_AI_GOLDEN_MAX_VECTORS 64U
#endif
#ifndef EDGEWIND_AI_GOLDEN_DIR
#define EDGEWIND_AI_GOLDEN_DIR "0:/ai_golden"
#endif
#ifndef EDGEWIND_DSP_SNAPSHOT_LOG_MS
#define EDGEWIND_DSP_SNAPSHOT_LOG_MS 5000U
#endif
#ifndef ESP32_SPI_FULL_PACKETS_PER_POLL
#define ESP32_SPI_FULL_PACKETS_PER_POLL 8U
#endif
#ifndef ESP32_SPI_FULL_YIELD_EVERY
#define ESP32_SPI_FULL_YIELD_EVERY 2U
#endif
#ifndef ESP32_SPI_FULL_PACKET_ACCEPT_TIMEOUT_MS
#define ESP32_SPI_FULL_PACKET_ACCEPT_TIMEOUT_MS 200U
#endif
#ifndef ESP32_SPI_FULL_PROGRESS_LOG_MS
#define ESP32_SPI_FULL_PROGRESS_LOG_MS 5000U
#endif
#ifndef ESP32_SPI_FULL_END_ACCEPT_TIMEOUT_MS
#define ESP32_SPI_FULL_END_ACCEPT_TIMEOUT_MS 500U
#endif
#ifndef ESP_SERVER_CMD_DEDUPE_WINDOW_MS
#define ESP_SERVER_CMD_DEDUPE_WINDOW_MS 120000U
#endif
#ifndef ESP32_SPI_AUTO_RECOVER_POLL_MS
#define ESP32_SPI_AUTO_RECOVER_POLL_MS 1500U
#endif
#ifndef ESP32_SPI_AUTO_RECOVER_RETRY_MS
#define ESP32_SPI_AUTO_RECOVER_RETRY_MS 3000U
#endif
#ifndef ESP32_SPI_AUTO_RECOVER_FAIL_BACKOFF_MS
#define ESP32_SPI_AUTO_RECOVER_FAIL_BACKOFF_MS 5000U
#endif
#ifndef ESP32_SPI_WIFI_CONNECT_SETTLE_MS
#define ESP32_SPI_WIFI_CONNECT_SETTLE_MS 30000U
#endif
#ifndef ESP32_SPI_WIFI_STATUS_POLL_MS
#define ESP32_SPI_WIFI_STATUS_POLL_MS 500U
#endif
#ifndef ESP_UPLOAD_SNAPSHOT_SLOT_COUNT
#define ESP_UPLOAD_SNAPSHOT_SLOT_COUNT 2U
#endif
#ifndef EW_FULL_PIPELINE_EXPERIMENT
#define EW_FULL_PIPELINE_EXPERIMENT 0
#endif

/* 引用 usart.c 中定义的句柄 */
#define ESP_PRINT_WAVEFORM_POINTS 0
#define ADS_BADFRAME_MONITOR 1
#ifndef ADS_BADFRAME_MONITOR
#define ADS_BADFRAME_MONITOR 0
#endif
/* =================================================================================
 * 浮点数输出安全：
 * - C 库 printf/sprintf 对 NaN/Inf 往往会输出 "nan"/"inf"（小写），这会导致 Python json.loads 直接解析失败，
 *   进而出现“服务器端全 0 / 节点超时注销 / 过几秒又恢复”等现象。
 * - 所以：所有写入 JSON 的 float 必须先做有限值钳位。
 * ================================================================================= */
static inline float ESP_SafeFloat(float v)
{
    /* NaN: v!=v；Inf: 与阈值比较会成立 */
    if (!(v == v))
        return 0.0f;
    if (v > 1.0e20f || v < -1.0e20f)
        return 0.0f;
    return v;
}

