lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/EdgeComm/edge_comm.c
/* ========= 上报数值格式（无浮点） =========
 * 用户要求：采集数据 *200 后按整数上传，JSON 里不再出现浮点数。
 * 说明：内部仍用 float 参与 FFT/计算，仅在“序列化到 JSON”阶段做定点缩放。 */
/* Current scale is 10x engineering units; see edgewind_units.h. */
#ifndef ESP_UPLOAD_SCALE
#define ESP_UPLOAD_SCALE EW_UPLOAD_ENGINEERING_VALUE_SCALE
#endif

/* 串口打印开关（默认关闭，避免影响 UI/上报性能）
 * 需求：打印“瞬时值(每点)”：printf("%f,%f,%f,%f", ch1,ch2,ch3,ch4)
 * 注意：若 STEP=1 且采样点很多，会显著占用 CPU/串口带宽，调试用即可。 */
#ifndef ESP_PRINT_WAVEFORM_POINTS
#define ESP_PRINT_WAVEFORM_POINTS 0
#endif

/* 打印步进：1=每点都打印；2=每 2 点打印一次... */
#ifndef ESP_PRINT_POINT_STEP
#define ESP_PRINT_POINT_STEP 1
#endif

static inline int32_t ESP_FloatToI32Scaled(float v)
{
    float x = ESP_SafeFloat(v) * (float)ESP_UPLOAD_SCALE;
    /* 四舍五入到整数 */
    return (int32_t)((x >= 0.0f) ? (x + 0.5f) : (x - 0.5f));
}

/* 安全追加格式化字符串到缓冲区（防止 http_packet_buf 越界导致“偶发坏帧/服务器解析失败/节点重连”） */
static inline int ESP_Appendf(char **pp, const char *end, const char *fmt, ...)
{
    if (!pp || !*pp || !end || *pp >= end)
        return 0;
    va_list ap;
    va_start(ap, fmt);
    int rem = (int)(end - *pp);
    int n = vsnprintf(*pp, (size_t)rem, fmt, ap);
    va_end(ap);
    if (n < 0)
        return 0;
    if (n >= rem)
    {
        /* 截断：把指针推进到末尾，返回失败 */
        *pp = (char *)end;
        return 0;
    }
    *pp += n;
    return 1;
}

/* Debug console uses USART1 only; ESP32 transport is SPI. */
static void ESP_Log(const char *format, ...);
static UART_HandleTypeDef *ESP_GetLogUart(void);
static void ESP_SetFaultCode(const char *code);
static void ESP_FaultLog_OnCodeChange(const char *old_code, const char *new_code, const char *source);
static void ESP_FaultLog_Poll(void);
static bool ESP_FaultLog_PrepareMounted(uint32_t wait_ms,
                                        FRESULT *mount_res,
                                        FRESULT *stat_res,
                                        DSTATUS *disk_status_out,
                                        uint8_t *card_state_out);
static void ESP_Console_HandleLine(char *line);
static void ESP_AI_GoldenSelfTest(void);
static void StrTrimInPlace(char *s);
void ESP_UI_Internal_OnLog(const char *line);
static void ESP_SetServerReportMode(uint8_t full);
static void ESP_SPI_ResetLocalReportState(const char *reason);
#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
static void ESP_SPI_FullClearWaitState(void);
static uint8_t ESP_SPI_FullClearStaleWaitState(const char *context);
static uint8_t ESP_SPI_FullClearBlockedTxState(const char *context, uint8_t link_not_ready);
static void ESP_SPI_FullResetUploadRuntimeState(void);
static void ESP_SPI_FullEnterHoldoff(const char *reason, uint32_t holdoff_ms);
static bool ESP_SPI_FullHoldoffActive(uint32_t now_tick);
#endif
static void ESP_SetServerDownsampleStep(uint32_t step);
static bool ESP_TryParseDownsampleStep(const char *s, uint32_t *out_step);
static void ESP_SetServerUploadPoints(uint32_t points);
static bool ESP_TryParseUploadPoints(const char *s, uint32_t *out_points);
static bool ESP_CommParams_SaveToSD(void);
static void ESP_SPI_ApplyCommParamsToCoprocessor(const ESP_CommParams_t *p);
static bool ESP_UploadMode_LoadFromSD(void);
static bool ESP_UploadMode_SaveToSD(uint8_t full);
static void ESP_SPI_FullArmFrames(uint16_t frames);
static void ESP_SPI_FullSetContinuous(uint8_t enable);
static void ESP_SPI_FullPrintStatus(void);
static void ESP_UI_SPI_LogStatus(const char *prefix);
static bool ESP_UI_DoApplyConfig(void);
static bool ESP_UI_DoWiFi(void);
static bool ESP_UI_DoTCP(void);
static bool ESP_UI_DoRegister(void);
static bool ESP_UI_EnsureReportStartedEx(uint8_t mode, const char *reason_tag, uint8_t force_start);
static bool ESP_UI_EnsureReportStarted(uint8_t mode, const char *reason_tag);
static void ESP_UI_ScheduleAutoRecover(const char *reason, uint8_t want_report);
static void ESP_UI_PollAutoRecover(void);
#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
static uint8_t ESP_SPI_FullControlBusy(void);
static void ESP_SPI_QueueCommParamsSync(const ESP_CommParams_t *p);
static void ESP_SPI_QueueReportModeSync(uint8_t full);
static void ESP_SPI_ServiceDeferredSync(void);
#endif


// 当前上报的故障码（默认正常 E00），可通过串口控制台动态修改
static char g_fault_code[4] = "E00";

typedef struct {
    uint8_t level;
    uint8_t code;
    uint8_t attempts;
    char msg[96];
} esp_fault_log_event_t;

static osMessageQueueId_t g_fault_log_q = NULL;
static char g_fault_log_last_status[80] = "等待故障变化";
static uint8_t g_fault_log_sd_ok = 0U;
static uint32_t g_fault_log_next_retry_tick = 0U;

static void ESP_FaultLog_EnsureQueue(void)
{
    if (g_fault_log_q == NULL && xTaskGetSchedulerState() != taskSCHEDULER_NOT_STARTED) {
        g_fault_log_q = osMessageQueueNew(8, sizeof(esp_fault_log_event_t), NULL);
        if (g_fault_log_q != NULL) {
            strncpy(g_fault_log_last_status, "等待故障变化", sizeof(g_fault_log_last_status) - 1U);
            g_fault_log_last_status[sizeof(g_fault_log_last_status) - 1U] = '\0';
        }
    }
}

static uint8_t g_ai_reported_class = 0U;
static uint8_t g_ai_fault_code_initialized = 0U;

static uint8_t ESP_FaultCodeToIndex(const char *code)
{
    if (code == NULL || code[0] != 'E' || code[1] < '0' || code[1] > '9' ||
        code[2] < '0' || code[2] > '9') {
        return 0U;
    }
    return (uint8_t)(((uint8_t)(code[1] - '0') * 10U) + (uint8_t)(code[2] - '0'));
}

static const char *ESP_FaultNameFromCode(const char *code)
{
    uint8_t idx = ESP_FaultCodeToIndex(code);
    switch (idx) {
    case 0U: return "正常运行";
    case 1U: return "交流窜入";
    case 2U: return "绝缘故障";
    case 3U: return "电容老化";
    case 4U: return "IGBT开路";
    case 5U: return "直流母线接地";
    case 6U: return "PWM异常";
    default: return "未知故障";
    }
}

static uint8_t ESP_FaultLevelFromCode(const char *code)
{
    uint8_t idx = ESP_FaultCodeToIndex(code);
    switch (idx) {
    case 4U:
    case 5U:
        return 3U;
    case 1U:
    case 2U:
    case 6U:
        return 2U;
    case 3U:
        return 1U;
    default:
        return 0U;
    }
}

static const char *ESP_FaultLevelTextFromCode(const char *code)
{
    switch (ESP_FaultLevelFromCode(code)) {
    case 3U: return "高";
    case 2U: return "中";
    case 1U: return "低";
    default: return "正常";
    }
}

static const char *ESP_FaultAdviceFromCode(const char *code)
{
    uint8_t idx = ESP_FaultCodeToIndex(code);
    switch (idx) {
    case 0U:
        return "持续监测，保持上传链路正常。";
    case 1U:
        return "检查交流侧隔离与整流输入，确认是否有交流分量窜入直流母线。";
    case 2U:
        return "复核绝缘电阻与泄漏电流，优先排查电缆、端子和潮湿污染点。";
    case 3U:
        return "关注纹波和温升，安排电容容量、ESR与外观检查。";
    case 4U:
        return "停机前按规程复核驱动、栅极信号和模块开路风险。";
    case 5U:
        return "立即检查接地支路、母线绝缘和保护动作记录，必要时人工隔离确认。";
    case 6U:
        return "复核PWM驱动、控制线缆和功率模块响应，观察是否重复出现。";
    default:
        return "保持监测，等待更多本机数据。";
    }
}

static void ESP_FaultLog_Enqueue(uint8_t level, uint8_t code, const char *msg)
{
    esp_fault_log_event_t ev;
    memset(&ev, 0, sizeof(ev));
    ev.level = level;
    ev.code = code;
    if (msg != NULL) {
        strncpy(ev.msg, msg, sizeof(ev.msg) - 1U);
        ev.msg[sizeof(ev.msg) - 1U] = '\0';
    }

    ESP_FaultLog_EnsureQueue();
    if (g_fault_log_q == NULL) {
        strncpy(g_fault_log_last_status, "SD记录队列未就绪", sizeof(g_fault_log_last_status) - 1U);
        g_fault_log_last_status[sizeof(g_fault_log_last_status) - 1U] = '\0';
        g_fault_log_sd_ok = 0U;
        return;
    }

    if (osMessageQueuePut(g_fault_log_q, &ev, 0U, 0U) != osOK) {
        strncpy(g_fault_log_last_status, "SD记录队列满，已丢弃", sizeof(g_fault_log_last_status) - 1U);
        g_fault_log_last_status[sizeof(g_fault_log_last_status) - 1U] = '\0';
        g_fault_log_sd_ok = 0U;
        ESP_Log("[FaultSD] queue full, drop code=E%02u\r\n", (unsigned int)code);
    }
}

static void ESP_FaultLog_OnCodeChange(const char *old_code, const char *new_code, const char *source)
{
    char msg[96];
    const char *src = (source != NULL) ? source : "local";
    if (old_code == NULL || new_code == NULL || strncmp(old_code, new_code, 3U) == 0) {
        return;
    }

