lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/EdgeComm/edge_comm.c
    if (strncmp(old_code, "E00", 3U) != 0 && strncmp(new_code, "E00", 3U) == 0) {
        uint8_t old_idx = ESP_FaultCodeToIndex(old_code);
        snprintf(msg, sizeof(msg), "故障恢复 %s %s 来源:%s", old_code, ESP_FaultNameFromCode(old_code), src);
        ESP_FaultLog_Enqueue(0U, old_idx, msg);
    } else if (strncmp(old_code, "E00", 3U) == 0 && strncmp(new_code, "E00", 3U) != 0) {
        uint8_t new_idx = ESP_FaultCodeToIndex(new_code);
        snprintf(msg, sizeof(msg), "故障发生 %s %s 等级:%s 来源:%s",
                 new_code, ESP_FaultNameFromCode(new_code), ESP_FaultLevelTextFromCode(new_code), src);
        ESP_FaultLog_Enqueue(ESP_FaultLevelFromCode(new_code), new_idx, msg);
    } else {
        uint8_t old_idx = ESP_FaultCodeToIndex(old_code);
        uint8_t new_idx = ESP_FaultCodeToIndex(new_code);
        snprintf(msg, sizeof(msg), "故障恢复 %s %s 来源:%s", old_code, ESP_FaultNameFromCode(old_code), src);
        ESP_FaultLog_Enqueue(0U, old_idx, msg);
        snprintf(msg, sizeof(msg), "故障发生 %s %s 等级:%s 来源:%s",
                 new_code, ESP_FaultNameFromCode(new_code), ESP_FaultLevelTextFromCode(new_code), src);
        ESP_FaultLog_Enqueue(ESP_FaultLevelFromCode(new_code), new_idx, msg);
    }
}

static bool ESP_FaultLog_PrepareMounted(uint32_t wait_ms,
                                        FRESULT *mount_res,
                                        FRESULT *stat_res,
                                        DSTATUS *disk_status_out,
                                        uint8_t *card_state_out)
{
    FRESULT mres;
    FRESULT sres;
    DSTATUS dstat;
    uint8_t cstate;

    if (SDPath[0] == '\0') {
        MX_FATFS_Init();
    }

    dstat = disk_initialize(0);
    uint32_t t0 = HAL_GetTick();
    do {
        cstate = BSP_SD_GetCardState();
        if (cstate == SD_TRANSFER_OK) {
            break;
        }
        osDelay(5);
    } while ((HAL_GetTick() - t0) < wait_ms);

    mres = f_mount(&SDFatFS, (TCHAR const *)SDPath, 1);
    DIR root_dir;
    sres = (mres == FR_OK) ? f_opendir(&root_dir, "0:/") : mres;
    if (sres == FR_OK) {
        (void)f_closedir(&root_dir);
    }

    if (mount_res != NULL) {
        *mount_res = mres;
    }
    if (stat_res != NULL) {
        *stat_res = sres;
    }
    if (disk_status_out != NULL) {
        *disk_status_out = dstat;
    }
    if (card_state_out != NULL) {
        *card_state_out = cstate;
    }
    return (mres == FR_OK && sres == FR_OK);
}

static void ESP_FaultLog_Poll(void)
{
    esp_fault_log_event_t ev;
    bool ok = false;
    bool locked = false;
    bool prepared = false;
    FRESULT mount_res = FR_INT_ERR;
    FRESULT stat_res = FR_INT_ERR;
    DSTATUS disk_st = STA_NOINIT;
    uint8_t card_state = 0xFFU;
    uint32_t now = HAL_GetTick();

    ESP_FaultLog_EnsureQueue();
    if (g_fault_log_q == NULL) {
        return;
    }
    if (g_fault_log_next_retry_tick != 0U &&
        (int32_t)(now - g_fault_log_next_retry_tick) < 0) {
        return;
    }
    if (osMessageQueueGet(g_fault_log_q, &ev, NULL, 0U) != osOK) {
        return;
    }

    if (!EdgeWind_SD_WaitIdle(1200U)) {
        g_fault_log_sd_ok = 0U;
        snprintf(g_fault_log_last_status, sizeof(g_fault_log_last_status),
                 "SD资源忙，待重试 E%02u", (unsigned int)ev.code);
        ESP_Log("[FaultSD] qspi/sd busy, retry code=E%02u\r\n", (unsigned int)ev.code);
        (void)osMessageQueuePut(g_fault_log_q, &ev, 0U, 0U);
        g_fault_log_next_retry_tick = now + 1000U;
        return;
    }

    locked = EdgeWind_SD_Lock(1800U);
    if (locked) {
        prepared = ESP_FaultLog_PrepareMounted(600U, &mount_res, &stat_res, &disk_st, &card_state);
        if (prepared) {
            ok = SD_Fault_LogMounted(ev.level, ev.code, ev.msg);
        }
        EdgeWind_SD_Unlock();
    } else {
        g_fault_log_sd_ok = 0U;
        snprintf(g_fault_log_last_status, sizeof(g_fault_log_last_status),
                 "SD锁忙，待重试 E%02u", (unsigned int)ev.code);
        ESP_Log("[FaultSD] lock busy, retry code=E%02u\r\n", (unsigned int)ev.code);
        (void)osMessageQueuePut(g_fault_log_q, &ev, 0U, 0U);
        g_fault_log_next_retry_tick = now + 1000U;
        return;
    }

    if (!prepared) {
        g_fault_log_sd_ok = 0U;
        ev.attempts++;
        snprintf(g_fault_log_last_status, sizeof(g_fault_log_last_status),
                 "SD挂载失败 m%d s%d", (int)mount_res, (int)stat_res);
        ESP_Log("[FaultSD] mount/stat failed retry=%u code=E%02u disk=0x%02X state=%u mount=%d stat=%d\r\n",
                (unsigned int)ev.attempts,
                (unsigned int)ev.code,
                (unsigned int)disk_st,
                (unsigned int)card_state,
                (int)mount_res,
                (int)stat_res);
        if (ev.attempts < 3U) {
            (void)osMessageQueuePut(g_fault_log_q, &ev, 0U, 0U);
            g_fault_log_next_retry_tick = now + 1000U;
        }
        return;
    }

    if (ok) {
        g_fault_log_sd_ok = 1U;
        snprintf(g_fault_log_last_status, sizeof(g_fault_log_last_status),
                 "SD已记录 E%02u", (unsigned int)ev.code);
        ESP_Log("[FaultSD] write ok level=%u code=E%02u msg=%s\r\n",
                (unsigned int)ev.level, (unsigned int)ev.code, ev.msg);
    } else {
        g_fault_log_sd_ok = 0U;
        ev.attempts++;
        if (ev.attempts < 3U) {
            snprintf(g_fault_log_last_status, sizeof(g_fault_log_last_status),
                     "SD写失败:%s 重试%u", SD_Fault_LastError(), (unsigned int)ev.attempts);
            ESP_Log("[FaultSD] write failed retry=%u level=%u code=E%02u err=%s msg=%s\r\n",
                    (unsigned int)ev.attempts,
                    (unsigned int)ev.level,
                    (unsigned int)ev.code,
                    SD_Fault_LastError(),
                    ev.msg);
            (void)osMessageQueuePut(g_fault_log_q, &ev, 0U, 0U);
            g_fault_log_next_retry_tick = now + 1000U;
            return;
        }
        snprintf(g_fault_log_last_status, sizeof(g_fault_log_last_status),
                 "SD写失败:%s E%02u", SD_Fault_LastError(), (unsigned int)ev.code);
        ESP_Log("[FaultSD] write failed final level=%u code=E%02u err=%s msg=%s\r\n",
                (unsigned int)ev.level,
                (unsigned int)ev.code,
                SD_Fault_LastError(),
                ev.msg);
    }
}

