lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/EdgeComm/edge_comm.c
static uint8_t ESP_AI_SelectReportedClass(const EdgeWind_AI_Result_t *result)
{
    if (result == NULL)
    {
        return g_ai_reported_class;
    }

    if ((result->class_id >= EDGEWIND_AI_CLASS_COUNT) ||
        (result->confidence < EDGEWIND_AI_CONFIDENCE_MIN))
    {
        g_ai_reported_class = 0U;
        return g_ai_reported_class;
    }

    g_ai_reported_class = result->class_id;
    return g_ai_reported_class;
}

static int ESP_AI_ProbPermille(float p)
{
    if ((p != p) || (p < 0.0f))
    {
        return 0;
    }
    if (p > 1.0f)
    {
        p = 1.0f;
    }
    return (int)((p * 1000.0f) + 0.5f);
}

static const float s_ai_default_aux4[EDGEWIND_AI_AUX_SIZE] =
{
    67.8480f, 55.7832f, 49.2850f, 3016.0754f
};

static float g_upload_aux4[EDGEWIND_AI_AUX_SIZE] =
{
    67.8480f, 55.7832f, 49.2850f, 3016.0754f
};
static uint8_t g_upload_aux4_valid_mask = 0U;

static void ESP_UploadAux4Remember(const float aux4[EDGEWIND_AI_AUX_SIZE],
                                   uint8_t aux4_valid_mask)
{
    const float *src = (aux4 != NULL) ? aux4 : s_ai_default_aux4;

    for (uint8_t i = 0U; i < EDGEWIND_AI_AUX_SIZE; i++)
    {
        g_upload_aux4[i] = ESP_SafeFloat(src[i]);
    }
    g_upload_aux4_valid_mask = aux4_valid_mask;
}

static void ESP_FillAuxReportChannels(esp32_spi_report_channel_t *channels,
                                      float *current_values,
                                      const float aux4[EDGEWIND_AI_AUX_SIZE],
                                      uint8_t aux4_valid_mask)
{
    const float *src = (aux4 != NULL) ? aux4 : s_ai_default_aux4;

    if (channels == NULL)
    {
        return;
    }

    for (uint8_t i = 0U; i < EDGEWIND_AI_AUX_SIZE; i++)
    {
        uint8_t dst = (uint8_t)(ESP_UPLOAD_FAST_CHANNEL_COUNT + i);
        float v = ESP_SafeFloat(src[i]);
        int32_t scaled = ESP_FloatToI32Scaled(v);

        channels[dst].channel_id = dst;
        channels[dst].channel_flags = ((aux4_valid_mask & (uint8_t)(1U << i)) != 0U) ?
                                      ESP_UPLOAD_CHANNEL_FLAG_VALID : 0U;
        channels[dst].waveform_count = 0U;
        channels[dst].fft_count = 0U;
        channels[dst].value_scaled = scaled;
        channels[dst].current_value_scaled = scaled;
        if (current_values != NULL)
        {
            current_values[dst] = v;
        }
    }
}

static void ESP_AI_UpdateFaultCode(const float analog_v[4][AD_ACQ_POINTS],
                                   const float aux4[EDGEWIND_AI_AUX_SIZE],
                                   uint8_t aux4_valid_mask)
{
    static uint32_t last_ai_log_tick = 0U;
    static uint32_t last_ai_run_tick = 0U;
    EdgeWind_AI_Result_t result;
    int ret;
    uint8_t reported_class;
    const char *reported_code;
    uint32_t now_tick = HAL_GetTick();

    if (g_ai_fault_code_initialized != 0U &&
        EDGEWIND_AI_RUN_INTERVAL_MS > 0U &&
        (uint32_t)(now_tick - last_ai_run_tick) < EDGEWIND_AI_RUN_INTERVAL_MS)
    {
        return;
    }
    last_ai_run_tick = now_tick;

    ret = EdgeWind_AI_RunOnAnalogWindow(analog_v, aux4, aux4_valid_mask, &result);
    if (ret != 0)
    {
        if ((g_ai_fault_code_initialized == 0U) || (strncmp(g_fault_code, "E00", 3U) != 0))
        {
            char old_code[4];
            strncpy(old_code, g_fault_code, sizeof(old_code) - 1U);
            old_code[sizeof(old_code) - 1U] = '\0';
            strncpy(g_fault_code, "E00", sizeof(g_fault_code) - 1U);
            g_fault_code[sizeof(g_fault_code) - 1U] = '\0';
            g_ai_reported_class = 0U;
            g_ai_fault_code_initialized = 1U;
            ESP_FaultLog_OnCodeChange(old_code, g_fault_code, "AI");
            ESP_Log("[AI] runtime error ret=%d; fallback report=E00\r\n", ret);
        }
        if ((uint32_t)(now_tick - last_ai_log_tick) >= EDGEWIND_AI_STATS_LOG_MS)
        {
            last_ai_log_tick = now_tick;
            ESP_Log("[AI] runtime error ret=%d; report=%s aux_valid=0x%02X\r\n",
                    ret,
                    g_fault_code,
                    (unsigned int)aux4_valid_mask);
        }
        EdgeWind_Buzzer_OnFaultCode(g_fault_code);
        return;
    }

    reported_class = ESP_AI_SelectReportedClass(&result);
    reported_code = EdgeWind_AI_ClassCode(reported_class);
    if ((g_ai_fault_code_initialized == 0U) || (strncmp(g_fault_code, reported_code, 3U) != 0))
    {
        char old_code[4];
        strncpy(old_code, g_fault_code, sizeof(old_code) - 1U);
        old_code[sizeof(old_code) - 1U] = '\0';
        strncpy(g_fault_code, reported_code, sizeof(g_fault_code) - 1U);
        g_fault_code[sizeof(g_fault_code) - 1U] = '\0';
        ESP_FaultLog_OnCodeChange(old_code, g_fault_code, "AI");
        ESP_Log("[AI] fault_code updated: %s\r\n", g_fault_code);
        g_ai_fault_code_initialized = 1U;
    }
    EdgeWind_Buzzer_OnFaultCode(reported_code);

    if ((uint32_t)(now_tick - last_ai_log_tick) >= EDGEWIND_AI_STATS_LOG_MS)
    {
        last_ai_log_tick = now_tick;
        ESP_Log("[AI] pred=%s/%s conf=%d.%03d report=%s model=%s aux4=[%.1f,%.1f,%.1f,%.1f] valid=0x%02X ppermil=[%d,%d,%d,%d,%d,%d,%d] feat=%lums infer=%lums total=%lums\r\n",
                result.fault_code,
                EdgeWind_AI_ClassName(result.class_id),
                (int)result.confidence,
                (int)((result.confidence - (float)((int)result.confidence)) * 1000.0f),
                reported_code,
                EdgeWind_AI_ModelVersion(),
                (double)result.aux4[0],
                (double)result.aux4[1],
                (double)result.aux4[2],
                (double)result.aux4[3],
                (unsigned int)result.aux4_valid_mask,
                ESP_AI_ProbPermille(result.probabilities[0]),
                ESP_AI_ProbPermille(result.probabilities[1]),
                ESP_AI_ProbPermille(result.probabilities[2]),
                ESP_AI_ProbPermille(result.probabilities[3]),
                ESP_AI_ProbPermille(result.probabilities[4]),
                ESP_AI_ProbPermille(result.probabilities[5]),
                ESP_AI_ProbPermille(result.probabilities[6]),
                (unsigned long)result.feature_ms,
                (unsigned long)result.inference_ms,
                (unsigned long)result.total_ms);
    }
}

static bool ESP_AcquisitionWindowAllZero(float (*src)[WAVEFORM_POINTS])
{
    if (src == NULL)
    {
        return false;
    }

