lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/EdgeComm/edge_comm.c
    for (uint8_t ch = 0U; ch < 4U; ch++)
    {
        for (int i = 0; i < WAVEFORM_POINTS; i++)
        {
            if (src[ch][i] != 0.0f)
            {
                return false;
            }
        }
    }
    return true;
}

#ifndef AXI_SRAM_SECTION
#define AXI_SRAM_SECTION __attribute__((section(".axi_sram")))
#endif

typedef struct
{
    float dwt[EDGEWIND_AI_DWT_SIZE];
    float feat[EDGEWIND_AI_FEAT_SIZE];
#if ESP_AI_HAS_RAWLITE
    float rawlite[EDGEWIND_AI_RAWLITE_SIZE];
#endif
    float spec[EDGEWIND_AI_SPEC_SIZE];
    float aux[EDGEWIND_AI_AUX_SIZE];
    float expected[EDGEWIND_AI_CLASS_COUNT];
} ESP_AI_GoldenBuffers_t;

static ESP_AI_GoldenBuffers_t g_ai_golden_expected AXI_SRAM_SECTION;
static ESP_AI_GoldenBuffers_t g_ai_golden_generated AXI_SRAM_SECTION;

Channel_Data_t node_channels[4] AXI_SRAM_SECTION;
volatile uint8_t g_esp_ready = 0U;
static volatile uint8_t g_report_enabled = 0U;
static volatile uint8_t g_ui_wifi_ok = 0U;
static volatile uint8_t g_ui_tcp_ok = 0U;
static volatile uint8_t g_ui_reg_ok = 0U;
static volatile uint8_t g_ui_auto_recover_pending = 0U;
static volatile uint8_t g_ui_auto_recover_want_report = 0U;
static uint32_t g_ui_auto_recover_next_poll_tick = 0U;
static uint32_t g_ui_auto_recover_next_attempt_tick = 0U;
static uint32_t g_ui_last_session_epoch = 0U;
static uint8_t g_ui_last_session_valid = 0U;

static SystemConfig_t g_sys_cfg;
static uint8_t g_sys_cfg_loaded = 0U;

static arm_rfft_fast_instance_f32 S;
static uint8_t fft_initialized = 0U;
static uint8_t channels_metadata_initialized = 0U;
static float32_t fft_input_buf[WAVEFORM_POINTS] AXI_SRAM_SECTION;
static float32_t fft_output_buf[WAVEFORM_POINTS] AXI_SRAM_SECTION;
static float32_t fft_mag_buf[WAVEFORM_POINTS] AXI_SRAM_SECTION;

static inline void ESP_RtosYield(void)
{
    if ((osKernelGetState() == osKernelRunning) && (__get_IPSR() == 0U))
    {
        osDelay(1);
    }
}

static void ESP_LoadConfig(void)
{
    if (g_sys_cfg_loaded)
    {
        return;
    }

    SD_Config_SetDefaults(&g_sys_cfg);
    g_sys_cfg_loaded = 1U;
}

const SystemConfig_t *ESP_Config_Get(void)
{
    if (!g_sys_cfg_loaded)
    {
        ESP_LoadConfig();
    }
    return &g_sys_cfg;
}

void ESP_Config_Apply(const SystemConfig_t *cfg)
{
    if (cfg == NULL)
    {
        return;
    }
    g_sys_cfg = *cfg;
    g_sys_cfg_loaded = 1U;
}

static void ESP_Init_Channels_And_DSP(void)
{
    if (!fft_initialized)
    {
        arm_rfft_fast_init_f32(&S, WAVEFORM_POINTS);
        fft_initialized = 1U;
    }

    if (channels_metadata_initialized)
    {
        return;
    }

    memset(node_channels, 0, sizeof(node_channels));
    node_channels[0].id = 0;
    strncpy(node_channels[0].label, "直流母线(+)", sizeof(node_channels[0].label) - 1U);
    strncpy(node_channels[0].unit, "V", sizeof(node_channels[0].unit) - 1U);

    node_channels[1].id = 1;
    strncpy(node_channels[1].label, "直流母线(-)", sizeof(node_channels[1].label) - 1U);
    strncpy(node_channels[1].unit, "V", sizeof(node_channels[1].unit) - 1U);

    node_channels[2].id = 2;
    strncpy(node_channels[2].label, "负载电流", sizeof(node_channels[2].label) - 1U);
    strncpy(node_channels[2].unit, "A", sizeof(node_channels[2].unit) - 1U);

    node_channels[3].id = 3;
    strncpy(node_channels[3].label, "漏电流", sizeof(node_channels[3].label) - 1U);
    strncpy(node_channels[3].unit, "mA", sizeof(node_channels[3].unit) - 1U);

    channels_metadata_initialized = 1U;
}

#if (ESP_UPLOAD_SNAPSHOT_SLOT_COUNT < 2)
#error "ESP_UPLOAD_SNAPSHOT_SLOT_COUNT must be at least 2"
#endif

#define ESP_UPLOAD_SNAPSHOT_MAGIC      0x45575550UL /* "EWUP" */
#define ESP_UPLOAD_SNAPSHOT_SDRAM_ADDR ((uintptr_t)0xC0680000UL)

typedef struct
{
    uint32_t magic;
    uint32_t seq;
    uint32_t tick_ms;
    uint8_t ready_buffer;
    uint8_t channel_count;
    uint8_t report_mode;
    uint8_t status_code;
    char fault_code[8];
    esp32_spi_report_channel_t channels[ESP_UPLOAD_REPORT_CHANNEL_COUNT];
    float current_value[ESP_UPLOAD_REPORT_CHANNEL_COUNT];
    float waveform[ESP_UPLOAD_FAST_CHANNEL_COUNT][WAVEFORM_POINTS];
    float fft_data[ESP_UPLOAD_FAST_CHANNEL_COUNT][FFT_POINTS];
} ESP_UploadSnapshot_t;

static ESP_UploadSnapshot_t * const g_upload_snapshots =
    (ESP_UploadSnapshot_t *)ESP_UPLOAD_SNAPSHOT_SDRAM_ADDR;
static volatile int8_t g_upload_snapshot_latest_idx = -1;
static volatile int8_t g_upload_snapshot_inflight_idx = -1;
static volatile int8_t g_upload_snapshot_writing_idx = -1;
static volatile uint8_t g_upload_snapshot_next_idx = 0U;
static volatile uint32_t g_upload_snapshot_seq = 0U;
static volatile uint32_t g_upload_snapshot_publish_count = 0U;
static volatile uint32_t g_upload_snapshot_drop_count = 0U;

static int8_t ESP_UploadSnapshot_BeginWrite(void)
{
    int8_t idx;

    taskENTER_CRITICAL();
    idx = (int8_t)(g_upload_snapshot_next_idx % ESP_UPLOAD_SNAPSHOT_SLOT_COUNT);
    if (idx == g_upload_snapshot_inflight_idx)
    {
        idx = (int8_t)((idx + 1) % ESP_UPLOAD_SNAPSHOT_SLOT_COUNT);
    }
    if (idx == g_upload_snapshot_inflight_idx)
    {
        taskEXIT_CRITICAL();
        return -1;
    }

    if (g_upload_snapshot_latest_idx >= 0)
    {
        g_upload_snapshot_drop_count++;
        g_upload_snapshot_latest_idx = -1;
    }
    g_upload_snapshot_writing_idx = idx;
    taskEXIT_CRITICAL();
    return idx;
}

static void ESP_UploadSnapshot_FinishWrite(int8_t idx, ESP_UploadSnapshot_t *slot)
{
    if (idx < 0 || slot == NULL)
    {
        return;
    }

    taskENTER_CRITICAL();
    slot->seq = ++g_upload_snapshot_seq;
    slot->magic = ESP_UPLOAD_SNAPSHOT_MAGIC;
    g_upload_snapshot_latest_idx = idx;
    g_upload_snapshot_next_idx = (uint8_t)((idx + 1) % ESP_UPLOAD_SNAPSHOT_SLOT_COUNT);
    g_upload_snapshot_writing_idx = -1;
    g_upload_snapshot_publish_count++;
    taskEXIT_CRITICAL();
}

static void ESP_UploadSnapshot_PublishFromNodeChannels(uint8_t ready_buffer,
                                                       const float aux4[EDGEWIND_AI_AUX_SIZE],
                                                       uint8_t aux4_valid_mask)
{
    int8_t idx = ESP_UploadSnapshot_BeginWrite();
    ESP_UploadSnapshot_t *slot;
    const float *aux_src = (aux4 != NULL) ? aux4 : s_ai_default_aux4;

    if (idx < 0)
    {
        g_upload_snapshot_drop_count++;
        return;
    }

    ESP_UploadAux4Remember(aux_src, aux4_valid_mask);

    slot = &g_upload_snapshots[(uint8_t)idx];
    memset(slot, 0, sizeof(*slot));
    slot->tick_ms = HAL_GetTick();
    slot->ready_buffer = ready_buffer;
    slot->channel_count = (uint8_t)ESP_UPLOAD_REPORT_CHANNEL_COUNT;
    slot->report_mode = 1U;
    slot->status_code = 1U;
    strncpy(slot->fault_code, g_fault_code, sizeof(slot->fault_code) - 1U);
    slot->fault_code[sizeof(slot->fault_code) - 1U] = '\0';

    for (uint8_t ch = 0U; ch < ESP_UPLOAD_FAST_CHANNEL_COUNT; ch++)
    {
        int32_t cv_i = ESP_FloatToI32Scaled(node_channels[ch].current_value);
        slot->channels[ch].channel_id = node_channels[ch].id;
        slot->channels[ch].channel_flags = ESP_UPLOAD_CHANNEL_FLAG_VALID;
        slot->channels[ch].waveform_count = (uint16_t)WAVEFORM_POINTS;
        slot->channels[ch].fft_count = (uint16_t)FFT_POINTS;
        slot->channels[ch].value_scaled = cv_i;
        slot->channels[ch].current_value_scaled = cv_i;
        slot->current_value[ch] = node_channels[ch].current_value;
        memcpy(slot->waveform[ch], node_channels[ch].waveform, sizeof(slot->waveform[ch]));
        memcpy(slot->fft_data[ch], node_channels[ch].fft_data, sizeof(slot->fft_data[ch]));
        ESP_RtosYield();
    }
    ESP_FillAuxReportChannels(slot->channels, slot->current_value, aux_src, aux4_valid_mask);

    ESP_UploadSnapshot_FinishWrite(idx, slot);
}

