lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/EdgeComm/edge_comm.c
static const ESP_UploadSnapshot_t *ESP_UploadSnapshot_TryAcquireLatest(uint32_t *out_seq)
{
    int8_t idx;
    uint32_t seq;

    taskENTER_CRITICAL();
    idx = g_upload_snapshot_latest_idx;
    if (idx < 0 || g_upload_snapshot_inflight_idx >= 0 || idx == g_upload_snapshot_writing_idx)
    {
        taskEXIT_CRITICAL();
        return NULL;
    }
    g_upload_snapshot_latest_idx = -1;
    g_upload_snapshot_inflight_idx = idx;
    seq = g_upload_snapshots[(uint8_t)idx].seq;
    taskEXIT_CRITICAL();

    if (g_upload_snapshots[(uint8_t)idx].magic != ESP_UPLOAD_SNAPSHOT_MAGIC)
    {
        taskENTER_CRITICAL();
        if (g_upload_snapshot_inflight_idx == idx)
        {
            g_upload_snapshot_inflight_idx = -1;
        }
        taskEXIT_CRITICAL();
        return NULL;
    }

    if (out_seq != NULL)
    {
        *out_seq = seq;
    }
    return &g_upload_snapshots[(uint8_t)idx];
}

static void ESP_UploadSnapshot_Release(uint32_t seq)
{
    int8_t idx;

    taskENTER_CRITICAL();
    idx = g_upload_snapshot_inflight_idx;
    if (idx >= 0 && g_upload_snapshots[(uint8_t)idx].seq == seq)
    {
        g_upload_snapshot_inflight_idx = -1;
    }
    taskEXIT_CRITICAL();
}

#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
typedef enum
{
    ESP_FULL_TX_IDLE = 0,
    ESP_FULL_TX_BEGIN,
    ESP_FULL_TX_WAVE,
    ESP_FULL_TX_FFT,
    ESP_FULL_TX_END,
} ESP_FullTxPhase_t;

typedef struct
{
    uint8_t active;
    uint8_t one_shot;
    uint8_t channel_count;
    ESP_FullTxPhase_t phase;
    uint32_t frame_id;
    uint32_t snapshot_seq;
    uint32_t start_tick;
    uint32_t packet_count;
    uint32_t wave_step;
    uint32_t upload_points;
    const ESP_UploadSnapshot_t *snapshot;
    esp32_spi_report_channel_t channels[ESP_UPLOAD_REPORT_CHANNEL_COUNT];
    const float *waves[ESP_UPLOAD_REPORT_CHANNEL_COUNT];
    const float *ffts[ESP_UPLOAD_REPORT_CHANNEL_COUNT];
    uint16_t wave_source_counts[ESP_UPLOAD_REPORT_CHANNEL_COUNT];
    uint8_t channel_index;
    uint16_t element_offset;
} ESP_FullTxState_t;

static ESP_FullTxState_t g_full_tx_sm;

static void ESP_FullTx_ClearAndRelease(void)
{
    if (g_full_tx_sm.snapshot_seq != 0U)
    {
        ESP_UploadSnapshot_Release(g_full_tx_sm.snapshot_seq);
    }
    memset(&g_full_tx_sm, 0, sizeof(g_full_tx_sm));
}
#endif

// ---------- 串口控制台（调试串口 RX 中断） ----------
static uint8_t g_console_rx_byte = 0;
static volatile uint8_t g_console_line_ready = 0;
static char g_console_line[32];
static volatile uint8_t g_console_line_len = 0;

// ---------- 服务器下发命令解析 ----------
static volatile uint8_t g_server_reset_pending = 0;
// 服务器请求的上报模式：0=summary, 1=full
static volatile uint8_t g_server_report_full = ((ESP_FORCE_FULL_REPORT_MODE != 0) || (ESP32_SPI_STRESS_FULL_UPLOAD != 0) || (ESP32_SPI_FULL_CONTINUOUS_DEFAULT != 0)) ? 1U : 0U;
static volatile uint8_t g_server_report_full_dirty = 0;
#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
static volatile uint16_t g_spi_full_manual_frames = 0;
static volatile uint8_t g_spi_full_continuous = ((ESP_FORCE_FULL_REPORT_MODE != 0) || (ESP32_SPI_FULL_CONTINUOUS_DEFAULT != 0)) ? 1U : 0U;
static volatile uint8_t g_spi_full_waiting_result = 0;
static uint32_t g_spi_full_result_ref_seq = 0U;
static uint32_t g_spi_full_result_frame_id = 0U;
static uint32_t g_spi_full_result_start_tick = 0U;
static uint32_t g_spi_full_result_session_epoch = 0U;
static uint32_t g_spi_full_result_last_log_tick = 0U;
static uint32_t g_spi_full_result_last_poll_tick = 0U;
static uint32_t g_spi_full_holdoff_until_tick = 0U;
static uint32_t g_spi_full_timeout_count = 0U;
static uint32_t g_spi_full_busy_nack_count = 0U;
static uint32_t g_spi_full_http_fail_count = 0U;
#endif
// 服务器请求的降采样步进：1..64
static volatile uint32_t g_server_downsample_step = (uint32_t)WAVEFORM_SEND_STEP;
static volatile uint8_t g_server_downsample_dirty = 0;
// 服务器请求的上传点数（降采样后）：256..4096，256步进
static volatile uint32_t g_server_upload_points = (uint32_t)WAVEFORM_POINTS;
static volatile uint8_t g_server_upload_points_dirty = 0;
#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
static volatile uint8_t g_spi_comm_params_sync_pending = 0U;
static volatile uint8_t g_spi_report_mode_sync_pending = 0U;
static volatile uint8_t g_spi_report_mode_sync_target = 0U;
static ESP_CommParams_t g_spi_pending_comm_params;
#endif
// 当检测到链路异常关键字（CLOSED/ERROR）时置 1，主循环触发软重连



/* 滑动窗口：用于在流式数据中查找关键字。
 * 解决 DMA 分包导致关键字（如 "HTTP/1.1"）被切断的问题。 */

/* 调试与统计变量 */

/* 链路健康监测 */

/* HTTP 发送流控门控
 * 作用：发送 HTTP 请求后置为 1，收到回复或超时后置为 0。
 * 防止请求发送过快淹没服务器，导致 TCP 拥塞或解析错误。 */

/* 分段发送状态（仅用于 ESP_Post_Data 的大包上报） */

/* 非分段 HTTP 发送链状态：header DMA -> body DMA */

/* ================= 通讯参数（运行时缓存） =================
 * 由 SD 文件 0:/config/ui_param.cfg 加载；若未加载则使用宏默认值。
 */
static volatile uint32_t g_comm_heartbeat_ms    = (uint32_t)ESP_HEARTBEAT_INTERVAL_MS;
static volatile uint32_t g_comm_min_interval_ms = (uint32_t)ESP_MIN_SEND_INTERVAL_MS;
static volatile uint32_t g_comm_http_timeout_ms = (uint32_t)ESP_HTTP_TIMEOUT_MS_DEFAULT;
static volatile uint32_t g_comm_hardreset_sec   = (uint32_t)ESP_NO_SERVER_RESPONSE_RECOVER_SEC;
static volatile uint32_t g_comm_wave_step       = (uint32_t)WAVEFORM_SEND_STEP;
static volatile uint32_t g_comm_upload_points  = (uint32_t)WAVEFORM_POINTS;
static volatile uint32_t g_comm_chunk_kb        = (uint32_t)ESP_CHUNK_KB_DEFAULT;
static volatile uint32_t g_comm_chunk_delay_ms  = (uint32_t)ESP_CHUNK_DELAY_MS_DEFAULT;
static volatile uint32_t g_comm_fft_enabled     = 1U;




/* ================= ESP 通讯参数 API（运行时可配置） ================= */
uint32_t ESP_CommParams_HeartbeatMs(void)    { return (uint32_t)g_comm_heartbeat_ms; }
uint32_t ESP_CommParams_MinIntervalMs(void) { return (uint32_t)g_comm_min_interval_ms; }
uint32_t ESP_CommParams_HttpTimeoutMs(void) { return (uint32_t)g_comm_http_timeout_ms; }
uint32_t ESP_CommParams_HardResetSec(void)  { return (uint32_t)g_comm_hardreset_sec; }
uint32_t ESP_CommParams_WaveStep(void)      { return (uint32_t)g_comm_wave_step; }
uint32_t ESP_CommParams_UploadPoints(void)  { return (uint32_t)g_comm_upload_points; }
uint32_t ESP_CommParams_ChunkKb(void)       { return (uint32_t)g_comm_chunk_kb; }
uint32_t ESP_CommParams_ChunkDelayMs(void)  { return (uint32_t)g_comm_chunk_delay_ms; }
uint32_t ESP_CommParams_FftEnabled(void)    { return (uint32_t)g_comm_fft_enabled; }

void ESP_CommParams_Get(ESP_CommParams_t *out)
{
    if (!out) return;
    out->heartbeat_ms    = (uint32_t)g_comm_heartbeat_ms;
    out->min_interval_ms = (uint32_t)g_comm_min_interval_ms;
    out->http_timeout_ms = (uint32_t)g_comm_http_timeout_ms;
    out->hardreset_sec   = (uint32_t)g_comm_hardreset_sec;
    out->wave_step       = (uint32_t)g_comm_wave_step;
    out->upload_points   = (uint32_t)g_comm_upload_points;
    out->chunk_kb        = (uint32_t)g_comm_chunk_kb;
    out->chunk_delay_ms  = (uint32_t)g_comm_chunk_delay_ms;
    out->fft_enabled     = (uint32_t)g_comm_fft_enabled;
}

