lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/EdgeComm/edge_comm.c
void ESP_CommParams_Apply(const ESP_CommParams_t *p)
{
    if (!p) return;
    /* 约束：避免极端值导致系统抖动或“永不发送” */
    uint32_t hb    = clamp_u32(p->heartbeat_ms,    200u, 54999u);
    uint32_t minit = clamp_u32(p->min_interval_ms, 0u,   600000u);
    uint32_t http  = clamp_u32(p->http_timeout_ms, 1000u, 600000u);
    uint32_t hrs   = clamp_u32(p->hardreset_sec,   5u,   3600u);
    uint32_t step  = clamp_u32(p->wave_step,       1u,   64u);
    uint32_t upmax = (uint32_t)WAVEFORM_POINTS;
    uint32_t up    = (uint32_t)p->upload_points;
    if (upmax == 0u) {
        up = 0u;
    } else if (upmax < 256u) {
        up = upmax;
    } else {
        if (up < 256u) up = 256u;
        if (up > upmax) up = upmax;
        /* 容错：非 256 步进时就近取整到 256 倍数 */
        up = ((up + 128u) / 256u) * 256u;
        if (up < 256u) up = 256u;
        if (up > upmax) up = upmax;
    }
    uint32_t ckb   = p->chunk_kb;
    if (ckb > 16u) ckb = 16u; /* 允许 0 表示“关闭分段” */
    uint32_t cdly  = clamp_u32(p->chunk_delay_ms,  0u,   (uint32_t)ESP_CHUNK_DELAY_MS_MAX);
    uint32_t fft_en = (p->fft_enabled != 0U) ? 1U : 0U;

    g_comm_heartbeat_ms    = hb;
    g_comm_min_interval_ms = minit;
    g_comm_http_timeout_ms = http;
    g_comm_hardreset_sec   = hrs;
    g_comm_wave_step       = step;
    g_comm_upload_points  = up;
    g_comm_chunk_kb        = ckb;
    g_comm_chunk_delay_ms  = cdly;
    g_comm_fft_enabled     = fft_en;

#if (ESP_DEBUG)
    ESP_Log("[PARAM] apply hb=%lums min=%lums http=%lums hrs=%lus step=%lu up=%lu chunk=%luKB delay=%lums fft=%lu\r\n",
            (unsigned long)hb, (unsigned long)minit, (unsigned long)http, (unsigned long)hrs,
            (unsigned long)step, (unsigned long)up, (unsigned long)ckb, (unsigned long)cdly,
            (unsigned long)fft_en);
#endif
}

static void cfg_rstrip(char *s)
{
    if (!s) return;
    size_t n = strlen(s);
    while (n > 0 && (s[n - 1] == '\r' || s[n - 1] == '\n' || s[n - 1] == ' ' || s[n - 1] == '\t')) {
        s[n - 1] = '\0';
        n--;
    }
}

static bool cfg_parse_u32_relaxed(const char *s, uint32_t *out)
{
    if (!out) return false;
    if (!s) return false;
    /* 容错：允许前面多余的 '=' 或空白（例如 "==60" / "=60"） */
    while (*s == '=' || *s == ' ' || *s == '\t')
        s++;
    if (!*s) return false;
    char *end = NULL;
    unsigned long v = strtoul(s, &end, 10);
    if (end == s) return false;
    *out = (uint32_t)v;
    return true;
}

static bool esp_wait_qspi_sd_idle(uint32_t wait_ms)
{
    return EdgeWind_SD_WaitIdle(wait_ms);
}

/* 上电/进入界面时加载一次：仅影响通讯参数缓存，不影响 WiFi/Server/SystemConfig_t */
bool ESP_CommParams_LoadFromSD(void)
{
    /* 避免与 QSPI/SD 同步竞争（该标志在 GUI_Assets_SyncFromSD 期间置位） */
    if (!esp_wait_qspi_sd_idle(800U)) {
        return false;
    }
    if (!EdgeWind_SD_Lock(1200U)) {
        return false;
    }

    /* 确保 FatFs 已初始化 */
    if (SDPath[0] == '\0') {
        MX_FATFS_Init();
    }

    /* 初始化磁盘 */
    (void)disk_initialize(0);

    /* 等待卡就绪（短超时） */
    uint32_t t0 = HAL_GetTick();
    while ((HAL_GetTick() - t0) < 200U) {
        if (BSP_SD_GetCardState() == SD_TRANSFER_OK) break;
        osDelay(5);
    }

    if (f_mount(&SDFatFS, (TCHAR const *)SDPath, 1) != FR_OK) {
        EdgeWind_SD_Unlock();
        return false;
    }

    FIL fil;
    if (f_open(&fil, "0:/config/ui_param.cfg", FA_READ) != FR_OK) {
        EdgeWind_SD_Unlock();
        return false;
    }

    ESP_CommParams_t p;
    ESP_CommParams_Get(&p); /* 先取当前值作为兜底 */

    char line[160];
    while (f_gets(line, sizeof(line), &fil)) {
        cfg_rstrip(line);
        if (strncmp(line, "HEARTBEAT_MS=", 13) == 0) {
            uint32_t v;
            if (cfg_parse_u32_relaxed(line + 13, &v)) p.heartbeat_ms = v;
        } else if (strncmp(line, "SENDLIMIT_MS=", 13) == 0) {
            uint32_t v;
            if (cfg_parse_u32_relaxed(line + 13, &v)) p.min_interval_ms = v;
        } else if (strncmp(line, "HTTP_TIMEOUT_MS=", 16) == 0) {
            uint32_t v;
            if (cfg_parse_u32_relaxed(line + 16, &v)) p.http_timeout_ms = v;
        } else if (strncmp(line, "HARDRESET_S=", 11) == 0) {
            uint32_t v;
            if (cfg_parse_u32_relaxed(line + 11, &v)) p.hardreset_sec = v;
        } else if (strncmp(line, "DOWNSAMPLE_STEP=", 16) == 0) {
            uint32_t v;
            if (cfg_parse_u32_relaxed(line + 16, &v)) p.wave_step = v;
        } else if (strncmp(line, "UPLOAD_POINTS=", 14) == 0) {
            uint32_t v;
            if (cfg_parse_u32_relaxed(line + 14, &v)) p.upload_points = v;
        } else if (strncmp(line, "CHUNK_KB=", 9) == 0) {
            uint32_t v;
            if (cfg_parse_u32_relaxed(line + 9, &v)) p.chunk_kb = v;
        } else if (strncmp(line, "CHUNK_DELAY_MS=", 15) == 0) {
            uint32_t v;
            if (cfg_parse_u32_relaxed(line + 15, &v)) p.chunk_delay_ms = v;
        } else if (strncmp(line, "FFT_ENABLED=", 12) == 0) {
            uint32_t v;
            if (cfg_parse_u32_relaxed(line + 12, &v)) p.fft_enabled = (v != 0U) ? 1U : 0U;
        }
    }
    (void)f_close(&fil);

    ESP_CommParams_Apply(&p);
    EdgeWind_SD_Unlock();
    return true;
}

/* ================= 断电重连/上报状态持久化（SD 标志位） ================= */
#define UI_CFG_DIR               "0:/config"
#define UI_WIFI_CFG_FILE         "0:/config/ui_wifi.cfg"
#define UI_SERVER_CFG_FILE       "0:/config/ui_server.cfg"
#define UI_PARAM_CFG_FILE        "0:/config/ui_param.cfg"
#define UI_PARAM_TMP_FILE        "0:/config/.ui_param.cfg.tmp"
#define UI_AUTOREPORT_CFG_FILE   "0:/config/ui_autoreport.cfg"
#define UI_AUTOREPORT_TMP_FILE   "0:/config/.ui_autoreport.cfg.tmp"
#define UI_UPLOAD_CFG_FILE       "0:/config/ui_upload.cfg"
#define UI_UPLOAD_TMP_FILE       "0:/config/.ui_upload.cfg.tmp"

static bool esp_sd_try_mount(uint32_t wait_ms)
{
    /* 避免与 QSPI/SD 同步竞争（该标志在 GUI_Assets_SyncFromSD 期间置位） */
    if (!esp_wait_qspi_sd_idle(800U)) {
        return false;
    }
    if (!EdgeWind_SD_Lock(wait_ms + 400U)) {
        return false;
    }

    if (SDPath[0] == '\0') {
        MX_FATFS_Init();
    }
    (void)disk_initialize(0);

