lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/EdgeComm/edge_comm.c
    uint32_t t0 = HAL_GetTick();
    while ((HAL_GetTick() - t0) < wait_ms) {
        if (BSP_SD_GetCardState() == SD_TRANSFER_OK) break;
        osDelay(5);
    }

    bool ok = (f_mount(&SDFatFS, (TCHAR const *)SDPath, 1) == FR_OK);
    EdgeWind_SD_Unlock();
    return ok;
}

static FRESULT ESP_AI_GoldenReadFloats(const char *path, float *dst, uint32_t count)
{
    FIL fil;
    UINT br = 0U;
    FRESULT res;
    UINT need = (UINT)(count * sizeof(float));

    if ((path == NULL) || (dst == NULL))
    {
        return FR_INVALID_PARAMETER;
    }
    res = f_open(&fil, path, FA_READ);
    if (res != FR_OK)
    {
        return res;
    }
    res = f_read(&fil, dst, need, &br);
    (void)f_close(&fil);
    if (res != FR_OK)
    {
        return res;
    }
    return (br == need) ? FR_OK : FR_INT_ERR;
}

static FRESULT ESP_AI_GoldenLoadRawWindow(const char *path, float out[4][AD_ACQ_POINTS])
{
    FIL fil;
    FRESULT res;
    int16_t tmp[128];
    UINT br = 0U;

    if ((path == NULL) || (out == NULL))
    {
        return FR_INVALID_PARAMETER;
    }
    res = f_open(&fil, path, FA_READ);
    if (res != FR_OK)
    {
        return res;
    }

    for (uint32_t ch = 0U; ch < 4U; ++ch)
    {
        uint32_t off = 0U;
        while (off < AD_ACQ_POINTS)
        {
            uint32_t n = AD_ACQ_POINTS - off;
            if (n > (sizeof(tmp) / sizeof(tmp[0])))
            {
                n = sizeof(tmp) / sizeof(tmp[0]);
            }
            res = f_read(&fil, tmp, (UINT)(n * sizeof(tmp[0])), &br);
            if ((res != FR_OK) || (br != (UINT)(n * sizeof(tmp[0]))))
            {
                (void)f_close(&fil);
                return (res != FR_OK) ? res : FR_INT_ERR;
            }
            for (uint32_t i = 0U; i < n; ++i)
            {
                out[ch][off + i] = ((float)tmp[i]) * 0.001f;
            }
            off += n;
        }
    }

    (void)f_close(&fil);
    return FR_OK;
}

static uint8_t ESP_AI_GoldenArgMax(const float *p, uint32_t count)
{
    uint8_t best = 0U;
    float best_v = -3.402823466e+38F;
    for (uint32_t i = 0U; i < count; ++i)
    {
        float v = p[i];
        if (v > best_v)
        {
            best_v = v;
            best = (uint8_t)i;
        }
    }
    return best;
}

static float ESP_AI_GoldenMaxAbsDiff(const float *a, const float *b, uint32_t count)
{
    float max_diff = 0.0f;
    for (uint32_t i = 0U; i < count; ++i)
    {
        float d = fabsf(a[i] - b[i]);
        if (d > max_diff)
        {
            max_diff = d;
        }
    }
    return max_diff;
}

static void ESP_AI_GoldenLogResult(const char *tag,
                                   uint32_t id,
                                   const EdgeWind_AI_Result_t *result,
                                   const float *expected,
                                   float max_prob_diff,
                                   float feat_diff,
                                   float dwt_diff,
                                   float rawlite_diff,
                                   float spec_diff,
                                   float aux_diff)
{
    uint8_t expected_id = ESP_AI_GoldenArgMax(expected, EDGEWIND_AI_CLASS_COUNT);
    ESP_Log("[AI_GOLDEN_%s] id=%lu expected=%s pred=%s conf=%d.%03d max_prob_diff=%d.%06d input_diff=[feat:%d.%06d,dwt:%d.%06d,rawlite:%d.%06d,spec:%d.%06d,aux:%d.%06d] ppermil=[%d,%d,%d,%d,%d,%d,%d]\r\n",
            tag,
            (unsigned long)id,
            EdgeWind_AI_ClassCode(expected_id),
            result->fault_code,
            (int)result->confidence,
            (int)((result->confidence - (float)((int)result->confidence)) * 1000.0f),
            (int)max_prob_diff,
            (int)((max_prob_diff - (float)((int)max_prob_diff)) * 1000000.0f),
            (int)feat_diff,
            (int)((feat_diff - (float)((int)feat_diff)) * 1000000.0f),
            (int)dwt_diff,
            (int)((dwt_diff - (float)((int)dwt_diff)) * 1000000.0f),
            (int)rawlite_diff,
            (int)((rawlite_diff - (float)((int)rawlite_diff)) * 1000000.0f),
            (int)spec_diff,
            (int)((spec_diff - (float)((int)spec_diff)) * 1000000.0f),
            (int)aux_diff,
            (int)((aux_diff - (float)((int)aux_diff)) * 1000000.0f),
            ESP_AI_ProbPermille(result->probabilities[0]),
            ESP_AI_ProbPermille(result->probabilities[1]),
            ESP_AI_ProbPermille(result->probabilities[2]),
            ESP_AI_ProbPermille(result->probabilities[3]),
            ESP_AI_ProbPermille(result->probabilities[4]),
            ESP_AI_ProbPermille(result->probabilities[5]),
            ESP_AI_ProbPermille(result->probabilities[6]));
}

static void ESP_AI_GoldenSelfTest(void)
{
    char path[96];
    uint32_t count = 0U;
    uint32_t direct_ok = 0U;
    uint32_t raw_ok = 0U;

    if (EDGEWIND_AI_GOLDEN_SELFTEST == 0)
    {
        ESP_Log("[AI_GOLDEN] disabled. Rebuild with EDGEWIND_AI_GOLDEN_SELFTEST=1 to run SD golden vectors.\r\n");
        return;
    }

    if (!esp_sd_try_mount(500U))
    {
        ESP_Log("[AI_GOLDEN] SD mount failed; expected %s/raw_00.bin\r\n", EDGEWIND_AI_GOLDEN_DIR);
        return;
    }

    ESP_Log("[AI_GOLDEN] start dir=%s max=%lu\r\n", EDGEWIND_AI_GOLDEN_DIR, (unsigned long)EDGEWIND_AI_GOLDEN_MAX_VECTORS);
    for (uint32_t id = 0U; id < EDGEWIND_AI_GOLDEN_MAX_VECTORS; ++id)
    {
        EdgeWind_AI_Result_t result;
        FRESULT res;
        int ret;
        float max_prob_diff;
        float feat_diff = 0.0f;
        float dwt_diff = 0.0f;
        float rawlite_diff = 0.0f;
        float spec_diff = 0.0f;
        float aux_diff = 0.0f;
        uint8_t expected_id;
        uint8_t inputs_loaded = 0U;

        (void)snprintf(path, sizeof(path), "%s/raw_%02lu.bin", EDGEWIND_AI_GOLDEN_DIR, (unsigned long)id);
        res = ESP_AI_GoldenLoadRawWindow(path, ADSA_B);
        if (res != FR_OK)
        {
            if (id == 0U)
            {
                ESP_Log("[AI_GOLDEN] first raw missing/unreadable: %s res=%d\r\n", path, (int)res);
            }
            break;
        }

        (void)snprintf(path, sizeof(path), "%s/expected_%02lu.bin", EDGEWIND_AI_GOLDEN_DIR, (unsigned long)id);
        res = ESP_AI_GoldenReadFloats(path, g_ai_golden_expected.expected, EDGEWIND_AI_CLASS_COUNT);
        if (res != FR_OK)
        {
            ESP_Log("[AI_GOLDEN] expected read failed id=%lu path=%s res=%d\r\n", (unsigned long)id, path, (int)res);
            break;
        }
        expected_id = ESP_AI_GoldenArgMax(g_ai_golden_expected.expected, EDGEWIND_AI_CLASS_COUNT);

