lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/EdgeComm/edge_comm.c
        (void)snprintf(path, sizeof(path), "%s/input_dwt_%02lu.bin", EDGEWIND_AI_GOLDEN_DIR, (unsigned long)id);
        res = ESP_AI_GoldenReadFloats(path, g_ai_golden_expected.dwt, EDGEWIND_AI_DWT_SIZE);
        if (res == FR_OK)
        {
            (void)snprintf(path, sizeof(path), "%s/input_feat_%02lu.bin", EDGEWIND_AI_GOLDEN_DIR, (unsigned long)id);
            res = ESP_AI_GoldenReadFloats(path, g_ai_golden_expected.feat, EDGEWIND_AI_FEAT_SIZE);
        }
#if ESP_AI_HAS_RAWLITE
        if (res == FR_OK)
        {
            (void)snprintf(path, sizeof(path), "%s/input_rawlite_%02lu.bin", EDGEWIND_AI_GOLDEN_DIR, (unsigned long)id);
            res = ESP_AI_GoldenReadFloats(path, g_ai_golden_expected.rawlite, EDGEWIND_AI_RAWLITE_SIZE);
        }
#endif
        if (res == FR_OK)
        {
            (void)snprintf(path, sizeof(path), "%s/input_spec_%02lu.bin", EDGEWIND_AI_GOLDEN_DIR, (unsigned long)id);
            res = ESP_AI_GoldenReadFloats(path, g_ai_golden_expected.spec, EDGEWIND_AI_SPEC_SIZE);
        }
        if ((res == FR_OK) && (EdgeWind_AI_UsesAuxInput() != 0U))
        {
            (void)snprintf(path, sizeof(path), "%s/input_aux_%02lu.bin", EDGEWIND_AI_GOLDEN_DIR, (unsigned long)id);
            res = ESP_AI_GoldenReadFloats(path, g_ai_golden_expected.aux, EDGEWIND_AI_AUX_SIZE);
        }
        if (res == FR_OK)
        {
            inputs_loaded = 1U;
            ret = EdgeWind_AI_DebugRunNormalizedInputs(g_ai_golden_expected.dwt,
                                                       g_ai_golden_expected.feat,
#if ESP_AI_HAS_RAWLITE
                                                       g_ai_golden_expected.rawlite,
#else
                                                       NULL,
#endif
                                                       g_ai_golden_expected.spec,
                                                       (EdgeWind_AI_UsesAuxInput() != 0U) ? g_ai_golden_expected.aux : NULL,
                                                       &result);
            if (ret == 0)
            {
                max_prob_diff = ESP_AI_GoldenMaxAbsDiff(result.probabilities, g_ai_golden_expected.expected, EDGEWIND_AI_CLASS_COUNT);
                if ((result.class_id == expected_id) && (max_prob_diff <= 0.02f))
                {
                    direct_ok++;
                }
                ESP_AI_GoldenLogResult("DIRECT", id, &result, g_ai_golden_expected.expected, max_prob_diff, 0.0f, 0.0f, 0.0f, 0.0f, 0.0f);
            }
            else
            {
                ESP_Log("[AI_GOLDEN_DIRECT] id=%lu ret=%d\r\n", (unsigned long)id, ret);
            }
        }
        else
        {
            ESP_Log("[AI_GOLDEN_DIRECT] id=%lu normalized input missing res=%d; skip direct check\r\n", (unsigned long)id, (int)res);
        }

        ret = EdgeWind_AI_DebugExtractInputs((const float (*)[AD_ACQ_POINTS])ADSA_B,
                                             s_ai_default_aux4,
                                             g_ai_golden_generated.dwt,
                                             g_ai_golden_generated.feat,
#if ESP_AI_HAS_RAWLITE
                                             g_ai_golden_generated.rawlite,
#else
                                             NULL,
#endif
                                             g_ai_golden_generated.spec,
                                             (EdgeWind_AI_UsesAuxInput() != 0U) ? g_ai_golden_generated.aux : NULL);
        if (ret != 0)
        {
            ESP_Log("[AI_GOLDEN_RAW] id=%lu extract ret=%d\r\n", (unsigned long)id, ret);
            break;
        }

        ret = EdgeWind_AI_RunOnAnalogWindow((const float (*)[AD_ACQ_POINTS])ADSA_B,
                                            s_ai_default_aux4,
                                            0x0FU,
                                            &result);
        if (ret != 0)
        {
            ESP_Log("[AI_GOLDEN_RAW] id=%lu run ret=%d\r\n", (unsigned long)id, ret);
            break;
        }

        max_prob_diff = ESP_AI_GoldenMaxAbsDiff(result.probabilities, g_ai_golden_expected.expected, EDGEWIND_AI_CLASS_COUNT);
        if ((result.class_id == expected_id) && (max_prob_diff <= 0.02f))
        {
            raw_ok++;
        }
        if (inputs_loaded != 0U)
        {
            feat_diff = ESP_AI_GoldenMaxAbsDiff(g_ai_golden_generated.feat, g_ai_golden_expected.feat, EDGEWIND_AI_FEAT_SIZE);
            dwt_diff = ESP_AI_GoldenMaxAbsDiff(g_ai_golden_generated.dwt, g_ai_golden_expected.dwt, EDGEWIND_AI_DWT_SIZE);
#if ESP_AI_HAS_RAWLITE
            rawlite_diff = ESP_AI_GoldenMaxAbsDiff(g_ai_golden_generated.rawlite, g_ai_golden_expected.rawlite, EDGEWIND_AI_RAWLITE_SIZE);
#else
            rawlite_diff = 0.0f;
#endif
            spec_diff = ESP_AI_GoldenMaxAbsDiff(g_ai_golden_generated.spec, g_ai_golden_expected.spec, EDGEWIND_AI_SPEC_SIZE);
            if (EdgeWind_AI_UsesAuxInput() != 0U)
            {
                aux_diff = ESP_AI_GoldenMaxAbsDiff(g_ai_golden_generated.aux, g_ai_golden_expected.aux, EDGEWIND_AI_AUX_SIZE);
            }
        }
        ESP_AI_GoldenLogResult("RAW",
                               id,
                               &result,
                               g_ai_golden_expected.expected,
                               max_prob_diff,
                               feat_diff,
                               dwt_diff,
                               rawlite_diff,
                               spec_diff,
                               aux_diff);
        count++;
    }
    ESP_Log("[AI_GOLDEN] done count=%lu direct_ok=%lu raw_ok=%lu threshold=0.02\r\n",
            (unsigned long)count,
            (unsigned long)direct_ok,
            (unsigned long)raw_ok);
}

static FRESULT esp_cfg_ensure_dir(void)
{
    FILINFO fno;
    FRESULT res = f_stat(UI_CFG_DIR, &fno);
    if (res == FR_OK) {
        return FR_OK;
    }
    res = f_mkdir(UI_CFG_DIR);
    if (res == FR_EXIST) {
        return FR_OK;
    }
    return res;
}

static bool ESP_CommParams_SaveToSD(void)
{
    if (!esp_sd_try_mount(200U)) {
        return false;
    }
    if (esp_cfg_ensure_dir() != FR_OK) {
        return false;
    }

