lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/EdgeComm/edge_comm.c
void ESP_Update_Data_And_FFT(void)
{
    static uint32_t last_calc_tick = 0;
    static uint32_t last_dsp_log_tick = 0;
    static uint32_t last_zero_window_log_tick = 0;
    static uint8_t last_ready = 0;
    uint32_t min_itv = ESP_ALGO_MIN_INTERVAL_MS;
    uint32_t now = HAL_GetTick();

    ESP_Init_Channels_And_DSP();

    uint8_t ready = 0;
    float (*src)[WAVEFORM_POINTS] = NULL;
    const float *aux4 = s_ai_default_aux4;
    uint8_t aux4_valid_mask = 0U;
    if (ADS131A04_flag == 1 && last_ready != 1)
    {
        ready = 1;
        src = ADSA_B;
        aux4 = ADSA_AUX4;
        aux4_valid_mask = ADSA_AUX4_valid_mask;
    }
    else if (ADS131A04_flag2 == 2 && last_ready != 2)
    {
        ready = 2;
        src = ADSA_B2;
        aux4 = ADSA_AUX4_2;
        aux4_valid_mask = ADSA_AUX4_2_valid_mask;
    }
    else
    {
        return;
    }

    if (min_itv > 0u)
    {
        if ((now - last_calc_tick) < min_itv)
        {
            return;
        }
    }
    last_calc_tick = now;

    if (ESP_AcquisitionWindowAllZero(src))
    {
        last_ready = ready;
        if ((now - last_zero_window_log_tick) >= 1000U)
        {
            last_zero_window_log_tick = now;
            ESP_Log("[AD7606] all-zero acquisition window suppressed ready=%u raw=[%04X,%04X,%04X,%04X] flags=%d/%d idx=%d/%d\r\n",
                    (unsigned int)ready,
                    (unsigned int)AD7606_DebugRaw[0],
                    (unsigned int)AD7606_DebugRaw[1],
                    (unsigned int)AD7606_DebugRaw[2],
                    (unsigned int)AD7606_DebugRaw[3],
                    ADS131A04_flag,
                    ADS131A04_flag2,
                    number,
                    number2);
        }
        return;
    }

    ESP_AI_UpdateFaultCode((const float (*)[AD_ACQ_POINTS])src, aux4, aux4_valid_mask);
    ESP_RtosYield();

    double sum0 = 0.0, sum1 = 0.0, sum2 = 0.0, sum3 = 0.0;
    double ssq0 = 0.0, ssq1 = 0.0, ssq2 = 0.0, ssq3 = 0.0;
    float min0 = 0.0f, min1 = 0.0f, min2 = 0.0f, min3 = 0.0f;
    float max0 = 0.0f, max1 = 0.0f, max2 = 0.0f, max3 = 0.0f;
    for (int i = 0; i < WAVEFORM_POINTS; i++)
    {
        float v0 = EW_AnalogVToPhysicalEngineering(0U, src[0][i]);
        float v1 = EW_AnalogVToPhysicalEngineering(1U, src[1][i]);
        float v2 = EW_AnalogVToPhysicalEngineering(2U, src[2][i]);
        float v3 = EW_AnalogVToPhysicalEngineering(3U, src[3][i]);
        if (i == 0)
        {
            min0 = max0 = v0;
            min1 = max1 = v1;
            min2 = max2 = v2;
            min3 = max3 = v3;
        }
        else
        {
            if (v0 < min0) min0 = v0;
            if (v0 > max0) max0 = v0;
            if (v1 < min1) min1 = v1;
            if (v1 > max1) max1 = v1;
            if (v2 < min2) min2 = v2;
            if (v2 > max2) max2 = v2;
            if (v3 < min3) min3 = v3;
            if (v3 > max3) max3 = v3;
        }
#if (ESP_PRINT_WAVEFORM_POINTS)
        /* 瞬时值(每点)：默认每点都打；可通过 ESP_PRINT_POINT_STEP 降频 */
        if ((ESP_PRINT_POINT_STEP <= 1) || ((i % ESP_PRINT_POINT_STEP) == 0))
        {
            printf("%f,%f,%f,%f\r\n", (double)v0, (double)v1, (double)v2, (double)v3);
        }
#endif
        node_channels[0].waveform[i] = v0;
        node_channels[1].waveform[i] = v1;
        node_channels[2].waveform[i] = v2;
        node_channels[3].waveform[i] = v3;
        sum0 += (double)v0;
        sum1 += (double)v1;
        sum2 += (double)v2;
        sum3 += (double)v3;
        ssq0 += (double)v0 * (double)v0;
        ssq1 += (double)v1 * (double)v1;
        ssq2 += (double)v2 * (double)v2;
        ssq3 += (double)v3 * (double)v3;
        /* 每 1024 点让出 CPU，避免长时间占用导致 UI 卡死（4096 点波形） */
        if ((i + 1) % 1024 == 0)
            ESP_RtosYield();
    }

    node_channels[0].current_value = ESP_SafeFloat((float)(sum0 / (double)WAVEFORM_POINTS));
    node_channels[1].current_value = ESP_SafeFloat((float)(sum1 / (double)WAVEFORM_POINTS));
    node_channels[2].current_value = ESP_SafeFloat((float)(sum2 / (double)WAVEFORM_POINTS));
    node_channels[3].current_value = ESP_SafeFloat((float)(sum3 / (double)WAVEFORM_POINTS));

    for (int ch = 0; ch < 4; ch++)
    {
        memcpy(fft_input_buf, node_channels[ch].waveform, sizeof(fft_input_buf));
        arm_rfft_fast_f32(&S, fft_input_buf, fft_output_buf, 0);
        arm_cmplx_mag_f32(fft_output_buf, fft_mag_buf, WAVEFORM_POINTS / 2);
        node_channels[ch].fft_data[0] = 0;
        for (int i = 1; i < FFT_POINTS; i++)
        {
            node_channels[ch].fft_data[i] = (fft_mag_buf[i] / (float)(WAVEFORM_POINTS / 2)) * 2.0f;
        }
        /* 每通道 FFT 完成后让出 CPU，避免 4 通道连续计算导致 UI 卡死 */
        ESP_RtosYield();
    }

    last_ready = ready;
    ESP_UploadSnapshot_PublishFromNodeChannels(ready, aux4, aux4_valid_mask);
    if ((HAL_GetTick() - last_dsp_log_tick) >= EDGEWIND_DSP_SNAPSHOT_LOG_MS)
    {
        last_dsp_log_tick = HAL_GetTick();
        float rms0 = sqrtf((float)(ssq0 / (double)WAVEFORM_POINTS));
        float rms1 = sqrtf((float)(ssq1 / (double)WAVEFORM_POINTS));
        float rms2 = sqrtf((float)(ssq2 / (double)WAVEFORM_POINTS));
        float rms3 = sqrtf((float)(ssq3 / (double)WAVEFORM_POINTS));
        uint16_t raw0 = AD7606_DebugRaw[0];
        uint16_t raw1 = AD7606_DebugRaw[1];
        uint16_t raw2 = AD7606_DebugRaw[2];
        uint16_t raw3 = AD7606_DebugRaw[3];
        uint16_t raw4 = AD7606_DebugRaw[4];
        uint16_t raw5 = AD7606_DebugRaw[5];
        uint16_t raw6 = AD7606_DebugRaw[6];
        uint16_t raw7 = AD7606_DebugRaw[7];
        float av0 = AD7606_DebugVolts[0];
        float av1 = AD7606_DebugVolts[1];
        float av2 = AD7606_DebugVolts[2];
        float av3 = AD7606_DebugVolts[3];
        float av4 = AD7606_DebugVolts[4];
        float av5 = AD7606_DebugVolts[5];
        float av6 = AD7606_DebugVolts[6];
        float av7 = AD7606_DebugVolts[7];
        ESP_Log("[DSP] snapshot seq=%lu pub=%lu drop=%lu ready=%u dt=%lums cv=[%.1f,%.1f,%.1f,%.1f] rms=[%.1f,%.1f,%.1f,%.1f] range=[%.1f..%.1f,%.1f..%.1f,%.1f..%.1f,%.1f..%.1f] aux4=[%.1f,%.1f,%.1f,%.1f] aux_valid=0x%02X adc_raw=[%04X,%04X,%04X,%04X,%04X,%04X,%04X,%04X] adc_v=[%.5f,%.5f,%.5f,%.5f,%.5f,%.5f,%.5f,%.5f] flags=%d/%d idx=%d/%d busy=%u db7=%u\r\n",
                (unsigned long)g_upload_snapshot_seq,
                (unsigned long)g_upload_snapshot_publish_count,
                (unsigned long)g_upload_snapshot_drop_count,
                (unsigned int)ready,
                (unsigned long)(HAL_GetTick() - now),
                (double)node_channels[0].current_value,
                (double)node_channels[1].current_value,
                (double)node_channels[2].current_value,
                (double)node_channels[3].current_value,
                (double)rms0,
                (double)rms1,
                (double)rms2,
                (double)rms3,
                (double)min0,
                (double)max0,
                (double)min1,
                (double)max1,
                (double)min2,
                (double)max2,
                (double)min3,
                (double)max3,
                (double)aux4[0],
                (double)aux4[1],
                (double)aux4[2],
                (double)aux4[3],
                (unsigned int)aux4_valid_mask,
                (unsigned int)raw0,
                (unsigned int)raw1,
                (unsigned int)raw2,
                (unsigned int)raw3,
                (unsigned int)raw4,
                (unsigned int)raw5,
                (unsigned int)raw6,
                (unsigned int)raw7,
                (double)av0,
                (double)av1,
                (double)av2,
                (double)av3,
                (double)av4,
                (double)av5,
                (double)av6,
                (double)av7,
                ADS131A04_flag,
                ADS131A04_flag2,
                number,
                number2,
                (unsigned int)AD7606_DebugBusy,
                (unsigned int)AD7606_DebugDb7);
    }
}

static void StrTrimInPlace(char *s)
{
    if (!s)
        return;
    // trim left
    char *p = s;
    while (*p == ' ' || *p == '\t' || *p == '\r' || *p == '\n')
        p++;
    if (p != s)
        memmove(s, p, strlen(p) + 1);
    // trim right
    size_t n = strlen(s);
    while (n > 0)
    {
        char c = s[n - 1];
        if (c == ' ' || c == '\t' || c == '\r' || c == '\n')
        {
            s[n - 1] = 0;
            n--;
        }
        else
            break;
    }
}

static void ESP_SPI_FullArmFrames(uint16_t frames)
{
#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
    uint32_t next;

    if (frames == 0U) {
        frames = 1U;
    }
    next = (uint32_t)g_spi_full_manual_frames + (uint32_t)frames;
    if (next > 1000U) {
        next = 1000U;
    }
    g_spi_full_manual_frames = (uint16_t)next;
    ESP_SetServerReportMode(1U);
    ESP_Log("[ESP32SPI] full armed: pending=%u continuous=%u\r\n",
            (unsigned int)g_spi_full_manual_frames,
            (unsigned int)g_spi_full_continuous);
#else
    (void)frames;
    ESP_Log("[ESP32SPI] full upload is not compiled in this build.\r\n");
#endif
}

static void ESP_SPI_FullSetContinuous(uint8_t enable)
{
#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
    g_spi_full_continuous = enable ? 1U : 0U;
    if (g_spi_full_continuous) {
        ESP_SetServerReportMode(1U);
    } else {
        g_spi_full_manual_frames = 0U;
        ESP_SetServerReportMode(0U);
    }
    ESP_Log("[ESP32SPI] full continuous=%u pending=%u\r\n",
            (unsigned int)g_spi_full_continuous,
            (unsigned int)g_spi_full_manual_frames);
#else
    (void)enable;
    ESP_Log("[ESP32SPI] full upload is not compiled in this build.\r\n");
#endif
}

