lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/EdgeComm/edge_comm.c
static void ESP_SPI_FullPrintStatus(void)
{
#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
    (void)ESP_SPI_FullClearStaleWaitState("status");
    (void)ESP_SPI_FullClearBlockedTxState("status", (g_esp_ready == 0U) ? 1U : 0U);
    ESP_Log("[ESP32SPI] full status: requested=%u continuous=%u pending=%u reporting=%u ready=%u active=%u phase=%u\r\n",
            (unsigned int)g_server_report_full,
            (unsigned int)g_spi_full_continuous,
            (unsigned int)g_spi_full_manual_frames,
            (unsigned int)ESP_UI_IsReporting(),
            (unsigned int)g_esp_ready,
            (unsigned int)g_full_tx_sm.active,
            (unsigned int)g_full_tx_sm.phase);
    if (g_spi_full_waiting_result != 0U) {
        ESP_Log("[ESP32SPI] full waiting: frame=%lu ref=%lu elapsed=%lums\r\n",
                (unsigned long)g_spi_full_result_frame_id,
                (unsigned long)g_spi_full_result_ref_seq,
                (unsigned long)(HAL_GetTick() - g_spi_full_result_start_tick));
    }
#else
    ESP_Log("[ESP32SPI] full upload is not compiled in this build.\r\n");
#endif
}

static void ESP_SetFaultCode(const char *code)
{
    if (!code)
        return;
    char old_code[4];
    char c0 = code[0];
    char c1 = code[1];
    char c2 = code[2];
    if (c0 == 'e')
        c0 = 'E'; // 兼容小写
    if (c0 != 'E')
        return;
    if (c1 < '0' || c1 > '9')
        return;
    if (c2 < '0' || c2 > '9')
        return;
    strncpy(old_code, g_fault_code, sizeof(old_code) - 1U);
    old_code[sizeof(old_code) - 1U] = '\0';
    g_fault_code[0] = 'E';
    g_fault_code[1] = c1;
    g_fault_code[2] = c2;
    g_fault_code[3] = 0;
    ESP_FaultLog_OnCodeChange(old_code, g_fault_code, "console");
    ESP_Log("[控制台] 故障码已切换为: %s（下一次上报生效）\r\n", g_fault_code);
}

static void ESP_Console_PrintFaultStatus(void)
{
    ESP_FaultLog_EnsureQueue();
    ESP_Log("[Fault] code=%s name=%s level=%s sd_ok=%u sd_status=%s q=%lu\r\n",
            g_fault_code,
            ESP_FaultNameFromCode(g_fault_code),
            ESP_FaultLevelTextFromCode(g_fault_code),
            (unsigned int)g_fault_log_sd_ok,
            g_fault_log_last_status,
            (unsigned long)((g_fault_log_q != NULL) ? osMessageQueueGetCount(g_fault_log_q) : 0U));
}

static void ESP_Console_PrintTimeStatus(void)
{
    char ts[24] = {0};
    uint32_t unix_local = SD_Time_GetUnix();
    esp32_spi_time_sync_t sync;

    if (!SD_Time_GetTimestamp(ts, sizeof(ts))) {
        strncpy(ts, "RTC_READ_FAIL", sizeof(ts) - 1U);
        ts[sizeof(ts) - 1U] = '\0';
    }

    if (ESP32_SPI_GetTimeSync(&sync)) {
        ESP_Log("[Time] rtc=%s unix_local=%lu server_unix=%lu offset=%d local=%s source=%u\r\n",
                ts,
                (unsigned long)unix_local,
                (unsigned long)sync.unix_utc,
                (int)sync.tz_offset_minutes,
                sync.iso_local,
                (unsigned int)sync.source);
    } else {
        ESP_Log("[Time] rtc=%s unix_local=%lu server_sync=none\r\n",
                ts,
                (unsigned long)unix_local);
    }
}

static void ESP_Console_SDStat(void)
{
    if (!EdgeWind_SD_WaitIdle(1200U)) {
        ESP_Log("[SDSTAT] qspi/sd sync busy\r\n");
        return;
    }
    if (!EdgeWind_SD_Lock(1800U)) {
        ESP_Log("[SDSTAT] lock busy\r\n");
        return;
    }

    FRESULT mount_res = FR_INT_ERR;
    FRESULT stat_res = FR_INT_ERR;
    DSTATUS disk_st = STA_NOINIT;
    uint8_t card_state = 0xFFU;
    uint8_t detected = BSP_SD_IsDetected();
    bool ok = ESP_FaultLog_PrepareMounted(700U, &mount_res, &stat_res, &disk_st, &card_state);
    DWORD free_clusters = 0U;
    FATFS *fs = NULL;
    FRESULT free_res = ok ? f_getfree("0:/", &free_clusters, &fs) : mount_res;

    ESP_Log("[SDSTAT] detected=%u disk=0x%02X card_state=%u mount=%d stat=%d free=%d clusters=%lu ok=%u\r\n",
            (unsigned int)detected,
            (unsigned int)disk_st,
            (unsigned int)card_state,
            (int)mount_res,
            (int)stat_res,
            (int)free_res,
            (unsigned long)free_clusters,
            ok ? 1U : 0U);
    EdgeWind_SD_Unlock();
}

static void ESP_Console_FaultSDTest(void)
{
    if (!EdgeWind_SD_WaitIdle(1200U)) {
        ESP_Log("[FaultSD] direct test skipped: qspi/sd sync busy\r\n");
        return;
    }
    if (!EdgeWind_SD_Lock(1800U)) {
        ESP_Log("[FaultSD] direct test skipped: lock busy\r\n");
        return;
    }

    FRESULT mount_res = FR_INT_ERR;
    FRESULT stat_res = FR_INT_ERR;
    DSTATUS disk_st = STA_NOINIT;
    uint8_t card_state = 0xFFU;
    bool prepared = ESP_FaultLog_PrepareMounted(700U, &mount_res, &stat_res, &disk_st, &card_state);
    bool ok = false;
    if (prepared) {
        ok = SD_Fault_LogMounted(2U, 2U, "串口faultsd测试");
    }
    EdgeWind_SD_Unlock();

    if (ok) {
        g_fault_log_sd_ok = 1U;
        snprintf(g_fault_log_last_status, sizeof(g_fault_log_last_status), "SD自测已记录 E02");
        ESP_Log("[FaultSD] direct test write ok\r\n");
    } else {
        g_fault_log_sd_ok = 0U;
        if (!prepared) {
            snprintf(g_fault_log_last_status, sizeof(g_fault_log_last_status),
                     "SD自测挂载失败 m%d s%d", (int)mount_res, (int)stat_res);
            ESP_Log("[FaultSD] direct test mount failed disk=0x%02X state=%u mount=%d stat=%d\r\n",
                    (unsigned int)disk_st,
                    (unsigned int)card_state,
                    (int)mount_res,
                    (int)stat_res);
        } else {
            snprintf(g_fault_log_last_status, sizeof(g_fault_log_last_status),
                     "SD自测写失败:%s", SD_Fault_LastError());
            ESP_Log("[FaultSD] direct test write failed err=%s\r\n", SD_Fault_LastError());
        }
    }
}

static void ESP_Console_FaultLogRecent(void)
{
    if (!EdgeWind_SD_WaitIdle(1200U)) {
        ESP_Log("[FaultLog] qspi/sd sync busy\r\n");
        return;
    }
    if (!EdgeWind_SD_Lock(1800U)) {
        ESP_Log("[FaultLog] lock busy\r\n");
        return;
    }

    FRESULT mount_res = FR_INT_ERR;
    FRESULT stat_res = FR_INT_ERR;
    DSTATUS disk_st = STA_NOINIT;
    uint8_t card_state = 0xFFU;
    bool prepared = ESP_FaultLog_PrepareMounted(700U, &mount_res, &stat_res, &disk_st, &card_state);
    FaultEntry_t entries[5];
    uint32_t count = 0U;
    bool ok = false;
    if (prepared) {
        ok = SD_Fault_GetRecentMounted(entries, 5U, &count);
    }
    EdgeWind_SD_Unlock();

