lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/EdgeComm/edge_comm.c
    if (!prepared) {
        ESP_Log("[FaultLog] mount failed disk=0x%02X state=%u mount=%d stat=%d\r\n",
                (unsigned int)disk_st,
                (unsigned int)card_state,
                (int)mount_res,
                (int)stat_res);
        return;
    }
    if (!ok) {
        ESP_Log("[FaultLog] read recent failed\r\n");
        return;
    }
    ESP_Log("[FaultLog] recent count=%lu\r\n", (unsigned long)count);
    for (uint32_t i = 0U; i < count; ++i) {
        ESP_Log("[FaultLog] #%lu ts=%lu level=%u code=E%02u msg=%s\r\n",
                (unsigned long)i,
                (unsigned long)entries[i].timestamp,
                (unsigned int)entries[i].level,
                (unsigned int)entries[i].code,
                entries[i].message);
    }
}

static void ESP_Console_HandleLine(char *line)
{
    if (!line)
        return;
    StrTrimInPlace(line);
    if (line[0] == 0)
        return;

    if (strcmp(line, "spiping") == 0 || strcmp(line, "SPIPING") == 0)
    {
        ESP32_SPI_DebugRunPing();
        return;
    }

    if (strcmp(line, "wifi") == 0 || strcmp(line, "WIFI") == 0)
    {
        (void)ESP_UI_SendCmd(ESP_UI_CMD_WIFI);
        ESP_Log("[Console] queued WIFI step\r\n");
        return;
    }

    if (strcmp(line, "tcp") == 0 || strcmp(line, "TCP") == 0)
    {
        (void)ESP_UI_SendCmd(ESP_UI_CMD_TCP);
        ESP_Log("[Console] queued TCP/CLOUD step\r\n");
        return;
    }

    if (strcmp(line, "reg") == 0 || strcmp(line, "REG") == 0)
    {
        (void)ESP_UI_SendCmd(ESP_UI_CMD_REG);
        ESP_Log("[Console] queued REG step\r\n");
        return;
    }

    if (strcmp(line, "report") == 0 || strcmp(line, "REPORT") == 0)
    {
        (void)ESP_UI_SendCmd(ESP_UI_CMD_REPORT_TOGGLE);
        ESP_Log("[Console] queued REPORT toggle\r\n");
        return;
    }

    if (strcmp(line, "auto") == 0 || strcmp(line, "AUTO") == 0)
    {
        (void)ESP_UI_SendCmd(ESP_UI_CMD_AUTO_CONNECT);
        ESP_Log("[Console] queued AUTO connect/report sequence\r\n");
        return;
    }

    if (strcmp(line, "full1") == 0 || strcmp(line, "FULL1") == 0)
    {
        ESP_SPI_FullArmFrames(1U);
        return;
    }

    if (strcmp(line, "full10") == 0 || strcmp(line, "FULL10") == 0)
    {
        ESP_SPI_FullArmFrames(10U);
        return;
    }

    if (strcmp(line, "fullon") == 0 || strcmp(line, "FULLON") == 0)
    {
        ESP_SPI_FullSetContinuous(1U);
        return;
    }

    if (strcmp(line, "fulloff") == 0 || strcmp(line, "FULLOFF") == 0)
    {
        ESP_SPI_FullSetContinuous(0U);
        return;
    }

    if (strcmp(line, "fullstat") == 0 || strcmp(line, "FULLSTAT") == 0)
    {
        ESP_SPI_FullPrintStatus();
        return;
    }

    if (strcmp(line, "aigolden") == 0 || strcmp(line, "AIGOLDEN") == 0)
    {
        ESP_AI_GoldenSelfTest();
        return;
    }

    if (strcmp(line, "fault?") == 0 || strcmp(line, "FAULT?") == 0)
    {
        ESP_Console_PrintFaultStatus();
        return;
    }

    if (strcmp(line, "time?") == 0 || strcmp(line, "TIME?") == 0)
    {
        ESP_Console_PrintTimeStatus();
        return;
    }

    if (strcmp(line, "sdstat") == 0 || strcmp(line, "SDSTAT") == 0)
    {
        ESP_Console_SDStat();
        return;
    }

    if (strcmp(line, "faultsd") == 0 || strcmp(line, "FAULTSD") == 0)
    {
        ESP_Console_FaultSDTest();
        return;
    }

    if (strcmp(line, "faultlog") == 0 || strcmp(line, "FAULTLOG") == 0)
    {
        ESP_Console_FaultLogRecent();
        return;
    }

    if (strcmp(line, "help") == 0 || strcmp(line, "?") == 0)
    {
        ESP_Log("[控制台] 可用命令：\r\n");
        ESP_Log("  - auto/wifi/tcp/reg/report : SPI cloud upload control\r\n");
        ESP_Log("  - spiping/fullstat/full1/full10/fullon/fulloff : SPI diagnostics\r\n");
        ESP_Log("  - aigolden : run SD AI golden-vector alignment when compiled in\r\n");
        ESP_Log("  - fault?/sdstat/faultsd/faultlog : SD fault-log diagnostics\r\n");
        ESP_Log("  - time? : RTC/server time sync diagnostics\r\n");
        ESP_Log("  - E00/E01/E02... ：切换上报故障码\r\n");
        ESP_Log("  - help 或 ?      ：显示帮助\r\n");
        return;
    }

    // 格式: E01
    if ((line[0] == 'E' || line[0] == 'e') && strlen(line) == 3)
    {
        ESP_SetFaultCode(line);
        return;
    }

    // 格式: fault E01
    if (strncmp(line, "fault", 5) == 0)
    {
        char *p = line + 5;
        while (*p == ' ' || *p == '\t')
            p++;
        if (strlen(p) == 3 && (p[0] == 'E' || p[0] == 'e'))
        {
            ESP_SetFaultCode(p);
            return;
        }
    }

    ESP_Log("[控制台] 未识别命令: %s（输入 help 查看帮助）\r\n", line);
}

static void ESP_SetServerReportMode(uint8_t full)
{
#if (ESP_FORCE_FULL_REPORT_MODE)
    full = 1U;
#endif
    full = (full != 0U) ? 1U : 0U;
    /* Treat every cloud command as an apply request.  After boot the runtime
       mode may come from SD while this command-cache variable is still at its
       compile-time default, so comparing only against g_server_report_full can
       incorrectly drop idempotent-looking commands. */
    g_server_report_full = full;
    g_server_report_full_dirty = 1U;
}

static void ESP_SPI_ResetLocalReportState(const char *reason)
{
    uint8_t want_report = (g_report_enabled != 0U) ? 1U : 0U;
    g_esp_ready = 0U;
    g_ui_reg_ok = 0U;
    g_ui_tcp_ok = 0U;
    g_ui_wifi_ok = 0U;
#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
    g_spi_full_manual_frames = 0U;
    ESP_SPI_FullResetUploadRuntimeState();
#endif
    if (want_report != 0U) {
        g_ui_auto_recover_want_report = 1U;
        (void)ESP_AutoReconnect_SetLastReporting(true);
        ESP_Log("[ESP32SPI] local report path degraded, keep desired reporting and recover: %s\r\n",
                (reason != NULL) ? reason : "unspecified");
        ESP_UI_ScheduleAutoRecover(reason, 1U);
    } else {
        g_report_enabled = 0U;
        ESP_SetServerReportMode(0U);
        (void)ESP_AutoReconnect_SetLastReporting(false);
        ESP_Log("[ESP32SPI] local report state reset: %s\r\n",
                (reason != NULL) ? reason : "unspecified");
    }
}

#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
static void ESP_SPI_FullClearWaitState(void)
{
    g_spi_full_waiting_result = 0U;
    g_spi_full_result_ref_seq = 0U;
    g_spi_full_result_frame_id = 0U;
    g_spi_full_result_start_tick = 0U;
    g_spi_full_result_session_epoch = 0U;
    g_spi_full_result_last_log_tick = 0U;
    g_spi_full_result_last_poll_tick = 0U;
}

