lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/EdgeComm/edge_comm.c
    // 2.1) 处理“服务器下发 downsample_step”指令
    if (g_server_downsample_dirty)
    {
        g_server_downsample_dirty = 0;

        ESP_CommParams_t old_p;
        ESP_CommParams_t p;
        ESP_CommParams_Get(&old_p);
        p = old_p;
        uint32_t target = (uint32_t)g_server_downsample_step;
        if (target < 1U) target = 1U;
        if (target > 64U) target = 64U;

        bool params_changed = (p.wave_step != target);
        if (p.wave_step != target) {
            p.wave_step = target;
            ESP_CommParams_Apply(&p);
        }

        if (params_changed) {
            if (ESP_CommParams_SaveToSD()) {
                server_cmd_saved = 1U;
                ESP_SPI_ApplyCommParamsToCoprocessor(&p);
                server_cmd_applied = 1U;
            } else {
                ESP_CommParams_Apply(&old_p);
                server_cmd_save_failed = 1U;
            }
        } else {
            ESP_SPI_ApplyCommParamsToCoprocessor(&p);
            server_cmd_applied = 1U;
        }
    }

    // 2.2) 处理“服务器下发 upload_points”指令
    if (g_server_upload_points_dirty)
    {
        g_server_upload_points_dirty = 0;

        ESP_CommParams_t old_p;
        ESP_CommParams_t p;
        ESP_CommParams_Get(&old_p);
        p = old_p;
        uint32_t target = (uint32_t)g_server_upload_points;

        bool params_changed = (p.upload_points != target);
        if (p.upload_points != target) {
            p.upload_points = target;
            ESP_CommParams_Apply(&p);
        }

        if (params_changed) {
            if (ESP_CommParams_SaveToSD()) {
                server_cmd_saved = 1U;
                ESP_SPI_ApplyCommParamsToCoprocessor(&p);
                server_cmd_applied = 1U;
            } else {
                ESP_CommParams_Apply(&old_p);
                server_cmd_save_failed = 1U;
            }
        } else {
            ESP_SPI_ApplyCommParamsToCoprocessor(&p);
            server_cmd_applied = 1U;
        }
    }

    if (server_cmd_seen != 0U) {
        if (server_cmd_save_failed != 0U || server_cmd_applied != 0U) {
            ESP_Log("[SERVER_CMD] received: %s\r\n", server_cmd_summary);
        }
        if (server_cmd_save_failed != 0U) {
            ESP_Log("[SERVER_CMD] save_failed: %s\r\n", server_cmd_summary);
            ESP_ServerCommandLogClear();
        } else if (server_cmd_saved != 0U) {
            ESP_Log("[SERVER_CMD] saved: SD\r\n");
        }
        if (server_cmd_save_failed == 0U && server_cmd_applied != 0U) {
            ESP_Log("[SERVER_CMD] applied: %s\r\n", server_cmd_summary);
            ESP_ServerCommandRememberApplied(server_cmd_summary, now);
            ESP_ServerCommandLogClear();
        } else if (server_cmd_save_failed == 0U) {
            ESP_ServerCommandLogStore(server_cmd_summary,
                                      server_cmd_seen,
                                      server_cmd_saved,
                                      server_cmd_save_failed,
                                      server_cmd_applied);
        }
    }


#if (ADS_BADFRAME_MONITOR)
    /* 每 1s 输出一次采样统计（在任务上下文输出，避免在TIM2 ISR里printf影响时序） */
    {
        static uint32_t last_print = 0;
        uint32_t now2 = HAL_GetTick();
        if ((now2 - last_print) >= 1000u)
        {
            last_print = now2;
            static uint32_t last_frames = 0, last_miss = 0;
            uint32_t frames = 0, miss = 0;
            AD7606_GetStats(&frames, &miss);
            uint32_t df = frames - last_frames;
            uint32_t dm = miss - last_miss;
            printf("[AD7606] frames=%lu (+%lu/s) miss=%lu (+%lu/s)\r\n",
                   (unsigned long)frames, (unsigned long)df,
                   (unsigned long)miss, (unsigned long)dm);
            last_frames = frames;
            last_miss = miss;
        }
    }
#endif
#endif
}

#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
static uint16_t ESP_FullTx_EffectiveWaveCount(uint32_t wave_step,
                                              uint32_t upload_points,
                                              uint16_t source_count)
{
    uint32_t step = (wave_step == 0U) ? 1U : wave_step;
    uint32_t limit = upload_points;
    uint32_t available;

    if (source_count == 0U)
    {
        return 0U;
    }
    if (limit == 0U || limit > (uint32_t)WAVEFORM_POINTS)
    {
        limit = (uint32_t)WAVEFORM_POINTS;
    }

    /* Number of samples that can be emitted from the full local window after
       applying downsample_step.  upload_points is a limit for the transmitted
       waveform, not a reason to touch the local DSP/algorithm window. */
    available = (((uint32_t)source_count + step - 1U) / step);
    if (limit > available)
    {
        limit = available;
    }
    if (limit > 65535U)
    {
        limit = 65535U;
    }
    return (uint16_t)limit;
}

static bool ESP_FullTx_StartFrame(uint32_t frame_id,
                                  const ESP_UploadSnapshot_t *snapshot,
                                  uint32_t snapshot_seq,
                                  uint8_t one_shot)
{
    uint8_t channel_count;
    uint32_t wave_step;
    uint32_t upload_points;
    uint8_t fft_upload_enabled;

    if (snapshot == NULL || snapshot->magic != ESP_UPLOAD_SNAPSHOT_MAGIC)
    {
        return false;
    }
    channel_count = snapshot->channel_count;
    if (channel_count == 0U || channel_count > ESP_UPLOAD_REPORT_CHANNEL_COUNT)
    {
        return false;
    }

    wave_step = ESP_CommParams_WaveStep();
    if (wave_step == 0U)
    {
        wave_step = 1U;
    }
    upload_points = ESP_CommParams_UploadPoints();
    if (upload_points == 0U || upload_points > (uint32_t)WAVEFORM_POINTS)
    {
        upload_points = (uint32_t)WAVEFORM_POINTS;
    }
    fft_upload_enabled = (ESP_CommParams_FftEnabled() != 0U) ? 1U : 0U;

    memset(&g_full_tx_sm, 0, sizeof(g_full_tx_sm));
    g_full_tx_sm.active = 1U;
    g_full_tx_sm.one_shot = one_shot;
    g_full_tx_sm.channel_count = channel_count;
    g_full_tx_sm.phase = ESP_FULL_TX_BEGIN;
    g_full_tx_sm.frame_id = frame_id;
    g_full_tx_sm.snapshot_seq = snapshot_seq;
    g_full_tx_sm.start_tick = HAL_GetTick();
    g_full_tx_sm.snapshot = snapshot;
    g_full_tx_sm.wave_step = wave_step;
    g_full_tx_sm.upload_points = upload_points;
    for (uint8_t i = 0U; i < channel_count; i++)
    {
        uint16_t source_wave_count;
        uint16_t tx_wave_count;

        if (snapshot->channels[i].waveform_count > WAVEFORM_POINTS ||
            snapshot->channels[i].fft_count > FFT_POINTS)
        {
            memset(&g_full_tx_sm, 0, sizeof(g_full_tx_sm));
            return false;
        }
        if (i >= ESP_UPLOAD_FAST_CHANNEL_COUNT &&
            (snapshot->channels[i].waveform_count != 0U || snapshot->channels[i].fft_count != 0U))
        {
            memset(&g_full_tx_sm, 0, sizeof(g_full_tx_sm));
            return false;
        }
        source_wave_count = snapshot->channels[i].waveform_count;
        tx_wave_count = (source_wave_count > 0U) ?
                        ESP_FullTx_EffectiveWaveCount(wave_step,
                                                      upload_points,
                                                      source_wave_count) : 0U;
        if (source_wave_count > 0U && tx_wave_count == 0U)
        {
            memset(&g_full_tx_sm, 0, sizeof(g_full_tx_sm));
            return false;
        }
        g_full_tx_sm.channels[i] = snapshot->channels[i];
        g_full_tx_sm.channels[i].waveform_count = tx_wave_count;
        if (fft_upload_enabled == 0U)
        {
            g_full_tx_sm.channels[i].fft_count = 0U;
        }
        g_full_tx_sm.wave_source_counts[i] = source_wave_count;
        g_full_tx_sm.waves[i] = (i < ESP_UPLOAD_FAST_CHANNEL_COUNT && source_wave_count > 0U) ?
                                snapshot->waveform[i] : NULL;
        g_full_tx_sm.ffts[i] = (i < ESP_UPLOAD_FAST_CHANNEL_COUNT && g_full_tx_sm.channels[i].fft_count > 0U) ?
                               snapshot->fft_data[i] : NULL;
    }
    return true;
}

