lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/EdgeComm/edge_comm.c
void ESP_UI_TaskPoll(void)
{
    if (!g_esp_ui_q)
        return;

    ESP_FaultLog_Poll();

    uint8_t c = 0xFF;
    /* 保持 FIFO：不要丢弃前置 WiFi/TCP/REG 等控制命令。按钮侧已做禁用/节流。 */
    if (osMessageQueueGet(g_esp_ui_q, &c, NULL, 0U) != osOK)
    {
        ESP_UI_PollAutoRecover();
        return;
    }

    {
        esp_ui_cmd_t cmd = (esp_ui_cmd_t)c;
        switch (cmd)
        {
        case ESP_UI_CMD_WIFI:
        {
            bool ok = ESP_UI_DoWiFi();
            esp_ui_step_done(cmd, ok);
        }
        break;
        case ESP_UI_CMD_TCP:
        {
            bool ok = ESP_UI_DoTCP();
            esp_ui_step_done(cmd, ok);
        }
        break;
        case ESP_UI_CMD_REG:
        {
            bool ok = ESP_UI_DoRegister();
            esp_ui_step_done(cmd, ok);
        }
        break;
        case ESP_UI_CMD_REPORT_TOGGLE:
        {
            bool before = ESP_UI_IsReporting();
            bool toggled_ok = ESP_UI_ToggleReport();
            bool after = ESP_UI_IsReporting();
            bool ok = toggled_ok && (before != after);
            esp_ui_step_done(cmd, ok);
        }
            break;
        case ESP_UI_CMD_AUTO_CONNECT:
            ESP_UI_AutoConnect();
            break;
        case ESP_UI_CMD_APPLY_CONFIG:
        {
            bool ok = ESP_UI_DoApplyConfig();
            esp_ui_step_done(cmd, ok);
        }
            break;
        default:
            break;
        }
    }

    if (osMessageQueueGetCount(g_esp_ui_q) == 0U) {
        ESP_UI_PollAutoRecover();
    }
}
